[
     {
          "title": "Summer Special Shrimp and Fruit Fried Rice",
          "url": "https://www.allrecipes.com/recipe/166862/summer-special-shrimp-and-fruit-fried-rice/",
          "rating": "4.50",
          "numreviews": "10",
          "ingredients": [
               "1 tablespoon vegetable oil, divided",
               "2 eggs, beaten",
               "1/2 pound peeled and deveined medium shrimp",
               "1 (1 inch) piece fresh ginger root, minced",
               "2 red onions, sliced",
               "3 green chile peppers, chopped",
               "2/3 cup fresh pineapple, diced",
               "1/2 cup orange segments",
               "6 walnuts, chopped",
               "2 cups cold, cooked white rice",
               "1 tablespoon soy sauce",
               "2 tablespoons chopped fresh cilantro",
               "salt and pepper to taste"
          ],
          "instructions": "Heat 1 teaspoon of the vegetable oil in a wok over medium-high heat. Pour in the onions, and cook until just set; set aside. Increase the heat to high, and pour another 1 teaspoon of oil to the wok. Stir in the shrimp, and cook until the shrimp turn pink, and are no longer translucent in the center, about 3 minutes; set aside.\nWipe out the wok, and heat the remaining teaspoon of oil over high heat. Stir in the ginger, and cook quickly for a few seconds until the ginger begins to turn golden brown. Stir in the onion and chile peppers; cook for a minute or two until the onions begin to soften and turn brown around the edges. Add the pineapple and oranges, and gently cook until the pineapple is hot.\nStir in the rice, walnuts, and soy sauce. Stir for a few minutes until the rice is hot. Fold in the egg, shrimp, and cilantro. Season to taste with salt and pepper, and cook to reheat.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/1078508.jpg"
     },
     {
          "title": "Strawberry-Rhubarb Compote",
          "url": "https://www.allrecipes.com/recipe/274342/strawberry-rhubarb-compote/",
          "rating": "0.00",
          "numreviews": "0",
          "ingredients": [
               "2 cups chopped fresh strawberries",
               "2 cups chopped rhubarb",
               "1/3 cup brown sugar",
               "1/8 teaspoon salt"
          ],
          "instructions": "Combine chopped strawberries and rhubarb in a saucepan. Add sugar and salt; stir to coat evenly. Let sit until fruit has released its juices, about 10 minutes.\nBring fruit mixture to a light boil over medium heat. Reduce heat to medium-low and simmer, stirring occasionally, until fruit is soft and mixture has thickened, about 20 minutes. Remove from heat and let cool, about 30 minutes. Mixture will further thicken upon cooling. Place in a jar or storage container and refrigerate for up to a week.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6750673.jpg"
     },
     {
          "title": "Sour Cream Blueberry Muffins ",
          "url": "https://www.allrecipes.com/recipe/274332/sour-cream-blueberry-muffins/",
          "rating": "0.00",
          "numreviews": "0",
          "ingredients": [
               "cooking spray",
               "Crumb Topping:",
               "1/2 cup all-purpose flour",
               "1/4 cup brown sugar",
               "1/2 teaspoon ground cinnamon",
               "1/4 teaspoon salt",
               "1/4 cup butter, softened",
               "Muffins:",
               "2 cups all-purpose flour",
               "3 teaspoons baking powder",
               "1 teaspoon cinnamon",
               "1/4 teaspoon salt",
               "2 large eggs",
               "1/2 cup granulated sugar",
               "1/2 cup brown sugar",
               "1 cup sour cream",
               "1/2 cup vegetable oil",
               "1 teaspoon vanilla extract",
               "2 cups blueberries",
               "1 tablespoon all-purpose flour"
          ],
          "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Spray 16 muffin cups with cooking spray or line cups with paper liners.\nCombine 1/2 cup flour, 1/4 cup brown sugar, 1/2 teaspoon cinnamon, and 1/4 teaspoon salt in a small bowl. Cut butter into the flour mixture until it is crumbly. Set crumb topping aside.\nWhisk 2 cups flour, baking powder, 1 teaspoon cinnamon, and 1/4 teaspoon salt together in a large bowl, making a well in the center. Whisk eggs, granulated sugar, and 1/2 cup brown sugar together in a separate bowl. Stir in sour cream, vegetable oil, and vanilla extract until well combined. Pour into the well in the flour mixture and stir until batter is just combined without overmixing. Toss blueberries with 1 tablespoon flour in a small bowl and gently fold into the batter.\nSpoon batter into the prepared muffin cups, filling each 3/4 full. Top each muffin with about 1 tablespoon of crumb mixture.\nBake in the preheated oven until tops spring back when lightly pressed and muffins are lightly browned, 18 to 22 minutes. A toothpick inserted into the center of the muffins should come out clean. Cool in the tins for 10 minutes. Transfer to a wire rack to cool completely.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6752952.jpg"
     },
     {
          "title": "Armenian Stuffed Eggplant (Imam Bayildi)",
          "url": "https://www.allrecipes.com/recipe/274390/armenian-stuffed-eggplant-imam-bayildi/",
          "rating": "0.00",
          "numreviews": "0",
          "ingredients": [
               "2 large eggplants",
               "1/4 cup olive oil, divided",
               "1 red bell pepper, cut into 1-inch strips",
               "1/2 onion, sliced",
               "3 cloves garlic, minced",
               "2 tomatoes, chopped",
               "1 (8 ounce) can tomato sauce with no salt added",
               "1/8 teaspoon salt",
               "1/8 teaspoon ground black pepper",
               "1 pinch chopped fresh parsley, or to taste"
          ],
          "instructions": "Preheat the oven to 450 degrees F (230 degrees C).\nCut eggplants in 1/2, then cut each 1/2 into thirds, leaving 12 eggplant spears total. Place on a baking sheet and brush with 2 tablespoons olive oil.\nRoast in the preheated oven until fork tender, 15 to 20 minutes. Reduce the oven temperature to 350 degrees F (175 degrees C).\nWhile eggplants are cooking, heat remaining 2 tablespoons olive oil over medium heat in a medium to large pan. Add bell pepper, onion, and garlic to the hot pan and cook until onions become tender, 5 to 7 minutes. Stir in tomatoes and cook until most of the liquid has evaporated, 2 to 3 minutes. Set aside to cool.\nRemove eggplants from the oven and let cool slightly, 5 to 10 minutes. Transfer eggplants to a 9x13-inch baking dish. Slice each spear vertically using a fork and knife, being careful not to cut through skin. Pry each open and fill with 2 to 3 tablespoons of tomato filling. Cover with tomato sauce.\nBake in the preheated oven until bubbling, about 30 minutes. Season with salt and pepper. Garnish with parsley.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6779557.jpg"
     },
     {
          "title": "Savory Western Crepes",
          "url": "https://www.allrecipes.com/recipe/274293/savory-western-crepes/",
          "rating": "0.00",
          "numreviews": "0",
          "ingredients": [
               "Crepe Batter:",
               "1 1/2 cups milk",
               "1 cup all-purpose flour",
               "2 large eggs",
               "2 tablespoons chopped fresh cilantro",
               "1 tablespoon melted butter",
               "2 teaspoons chile-garlic sauce (such as Sriracha(R))",
               "Crepe Filling:",
               "8 large eggs",
               "1/4 cup milk",
               "1/2 cup shredded Cheddar cheese",
               "salt and freshly ground black pepper to taste",
               "1 teaspoon olive oil",
               "1/3 cup diced onion",
               "1/3 cup diced red bell pepper",
               "3 tablespoons diced jalapeno pepper (optional)",
               "1/2 cup chopped ham",
               "2 tablespoons melted butter, or as needed, divided"
          ],
          "instructions": "Combine milk, flour, eggs, cilantro, melted butter, and chile-garlic sauce in a blender. Blend until smooth and very thin, about 1 minute. Set batter aside to rest for at least 30 minutes.\nHeat a crepe pan or small skillet over medium heat. Brush 1 tablespoon melted butter into the pan using a pastry brush and add 1/2 cup of crepe batter. Pick up the pan, tipping and rotating so batter forms a round shape and evenly coats the entire bottom of the pan. Return the pan to the burner and cook until small brown spots appear on the bottom of the crepe, 1 to 2 minutes.\nLoosen crepe carefully using a spatula and gently flip it to brown the other side; cook for 30 to 60 seconds. Slide cooked crepe onto a plate. Repeat to cook additional crepes, adding more butter if needed, and stacking crepes on top of the first.\nWhisk eggs and milk in a large bowl until well blended. Stir in Cheddar cheese, salt, and pepper.\nHeat oil in a skillet over medium heat. Add onion, bell pepper, and jalapeno pepper and cook until tender, about 3 minutes. Stir in ham and continue cooking for another 2 minutes. Reduce heat to low and stir 1 tablespoon melted butter into the skillet. Add egg mixture and cook, stirring until eggs are scrambled and wet, but no longer runny, 3 to 5 minutes. Remove from heat.\nSpoon about 1/4 cup of the egg mixture across the lower 1/3 of a crepe and roll up like a jelly roll. Repeat with remaining crepes and filling.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6732798.jpg"
     },
     {
          "title": "Lemon-Blueberry Scones with Blueberry Glaze",
          "url": "https://www.allrecipes.com/recipe/274317/lemon-blueberry-scones-with-blueberry-glaze/",
          "rating": "0.00",
          "numreviews": "0",
          "ingredients": [
               "1 1/4 cups whole wheat flour",
               "1 cup all-purpose flour",
               "1/4 cup white sugar",
               "2 1/2 teaspoons baking powder",
               "1 teaspoon ground cardamom",
               "1 teaspoon lemon zest",
               "1/2 teaspoon baking soda",
               "1/2 teaspoon salt",
               "1/4 teaspoon ground ginger",
               "1/2 cup unsalted butter, frozen",
               "1/2 cup whole-milk Greek yogurt",
               "3 tablespoons heavy cream",
               "1 egg",
               "2 teaspoons vanilla extract",
               "1 cup frozen blueberries, unthawed",
               "Egg Wash:",
               "1 egg",
               "1 teaspoon water",
               "Glaze:",
               "1/4 cup frozen blueberries, thawed",
               "2/3 cup confectioners' sugar",
               "1 tablespoon lemon juice"
          ],
          "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Line a large baking sheet with parchment paper.\nCombine whole wheat flour, all-purpose flour, sugar, baking powder, cardamom, lemon zest, baking soda, salt, and ginger in a large bowl. Grate in frozen butter using a box grater and toss until mixture resembles coarse crumbs.\nMix yogurt, cream, egg, and vanilla extract together in a small bowl. Add to the flour mixture to form a crumbly dough, stirring just until no dry clumps of flour remain. Stir in unthawed blueberries.\nPour crumbly dough onto the parchment-lined baking sheet. Press dough together firmly until it forms a cohesive 8-inch circle. Flatten top to ensure the circle is even. Cut into 8 triangular pieces. Arrange the pieces 1 inch apart on the same parchment-lined pan.\nWhisk egg and water together in a small bowl for the egg wash. Gently brush over the top of each scone.\nBake scones in the preheated oven until tops are golden brown, 20 to 25 minutes. Let cool completely, about 30 minutes.\nUse the back of a wooden spoon to press thawed blueberries through a fine-mesh strainer into a medium bowl to extract 2 or 3 tablespoons of juice. Discards skins and seeds. Whisk confectioners' sugar and lemon juice into the blueberry juice until smooth. Drizzle blueberry glaze over cooled scones.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6765602.jpg"
     },
     {
          "title": "Garlic Shrimp Kabobs",
          "url": "https://www.allrecipes.com/recipe/273793/garlic-shrimp-kabobs/",
          "rating": "5.00",
          "numreviews": "1",
          "ingredients": [
               "1 pound frozen shrimp, thawed and peeled",
               "1/4 cup olive oil",
               "1 tablespoon minced garlic",
               "2 teaspoons lemon juice",
               "1/4 teaspoon pepper",
               "1 pinch finely chopped parsley",
               "metal skewers",
               "cooking spray"
          ],
          "instructions": "Rinse and dry shrimp.\nWhisk olive oil, garlic, lemon juice, pepper, and parsley together in a bowl and pour into a large resealable plastic bag. Add shrimp, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 2 hours.\nPreheat an outdoor grill for medium heat and lightly oil the grate. Lightly coat metal skewers with cooking spray.\nRemove shrimp from the marinade and shake off excess. Discard the remaining marinade. Place about 5 shrimp on each skewer.\nCook on the preheated grill until shrimp are bright pink on the outside and the meat is opaque, about 5 minutes; do not overcook.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6795468.jpg"
     },
     {
          "title": "Strawberry Lemonade Cake",
          "url": "https://www.allrecipes.com/recipe/274413/strawberry-lemonade-cake/",
          "rating": "0.00",
          "numreviews": "0",
          "ingredients": [
               "Strawberry Reduction:",
               "5 cups fresh strawberries, hulled and sliced",
               "1/4 cup white sugar",
               "1 tablespoon lemon juice",
               "Cake:",
               "3 cups all-purpose flour",
               "1 teaspoon baking soda",
               "1 teaspoon baking powder",
               "1/2 teaspoon salt",
               "2 cups white sugar",
               "1 cup unsalted butter, softened",
               "4 eggs, room temperature",
               "1 1/2 tablespoons lemon zest",
               "1 teaspoon vanilla extract",
               "3/4 cup sour cream, room temperature",
               "1/4 cup lemon juice",
               "Frosting:",
               "1 1/2 cups unsalted butter, softened",
               "5 cups powdered sugar, or more as needed",
               "1 tablespoon lemon juice",
               "1 teaspoon vanilla extract",
               "1 teaspoon lemon zest",
               "1/4 teaspoon salt",
               "4 tablespoons heavy cream"
          ],
          "instructions": "Place strawberries, sugar, and lemon juice for the reduction into an electric blender and puree until smooth.\nPour strawberry mixture into a large saucepan and simmer over medium heat, stirring frequently, until reduced by 1/2, 20 to 25 minutes. Remove from heat and let cool to room temperature, 10 to 15 minutes. Reserve 1/2 cup plus 5 tablespoons for cake and frosting; remainder will be used as cake filling.\nPreheat the oven to 350 degrees F (175 degrees C). Grease two 9-inch cake pans and line with parchment paper.\nWhisk flour, baking soda, baking powder, and salt together in a medium bowl. Set aside.\nBeat sugar and butter using an electric mixer in a large bowl until creamy. Beat in eggs one at a time, mixing thoroughly after each addition. Mix in lemon zest and vanilla extract. Stir in 1/3 of the flour mixture until just combined. Stir in 1/2 of the sour cream, and 1/2 of the lemon juice. Repeat alternating additions of flour mixture and sour cream plus lemon juice until just combined, making sure not to overmix.\nPlace 1/2 of the batter into a separate bowl. Fold in 1/2 cup strawberry reduction. Place dollops of both lemon and strawberry-lemon batters alternately into the prepared cake pans. Swirl batters together with a butter knife.\nBake in the preheated oven until a toothpick inserted into the center of each cake comes out clean, 30 to 35 minutes. Remove from the oven and let cool for 10 minutes in the pans before removing and transferring cakes to a wire rack to cool completely, 15 to 30 minutes.\nWhile cakes are cooling, beat butter for frosting with an electric mixer in a mixing bowl until light and fluffy. Beat in powdered sugar 1 cup at a time until incorporated. Mix in 5 tablespoons strawberry reduction, lemon juice, vanilla extract, lemon zest, and salt until combined. Pour in heavy cream and beat until frosting is smooth and fluffy, 2 to 3 minutes. Add additional powdered sugar if too thin, or additional heavy cream if too thick, 1 tablespoon at a time, until desired consistency is reached.\nPlace 1 cooled cake layer on a serving platter and cover top with a thin layer of frosting. Pipe a border around the edge of the cake layer using a piping bag filled with frosting, leaving the center open. Pour remaining strawberry reduction into the center of the border, making sure it doesn't overflow over the sides. Place second cake layer on top and continue to frost as desired. Keep refrigerated until ready to serve.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6799549.jpg"
     },
     {
          "title": "Bucatini Cacio e Pepe (Roman Sheep Herder's Pasta)",
          "url": "https://www.allrecipes.com/recipe/274411/bucatini-cacio-e-pepe-roman-sheep-herders-pasta/",
          "rating": "0.00",
          "numreviews": "0",
          "ingredients": [
               "1 teaspoon salt",
               "1 pound bucatini (dry)",
               "2 cups finely grated Pecorino Romano cheese",
               "1 1/2 tablespoons freshly ground black pepper, or more to taste"
          ],
          "instructions": "Bring a large pot of water to a boil and add salt. Cook bucatini in the boiling water, stirring occasionally, until tender yet firm to the bite, 8 to 10 minutes.\nPlace grated Pecorino Romano cheese into a large glass bowl and mix with a fork to make sure the cheese contains no lumps.\nOnce the bucatini are al dente, lift them out with a spaghetti fork or tongs and put them directly into the bowl with the cheese. Do not allow the water to drain too much.\nAdd one ladle of pasta water to the bowl. Stir the bucatini around until a cream has formed. Add more pasta water, little by little, until a thick cream has formed. Sprinkle freshly ground pepper over the pasta. Toss and serve immediately.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/2253389.jpg"
     },
     {
          "title": "World's Best Lasagna",
          "url": "https://www.allrecipes.com/recipe/23600/worlds-best-lasagna/",
          "rating": "4.79",
          "numreviews": "12260",
          "ingredients": [
               "1 pound sweet Italian sausage",
               "3/4 pound lean ground beef",
               "1/2 cup minced onion",
               "2 cloves garlic, crushed",
               "1 (28 ounce) can crushed tomatoes",
               "2 (6 ounce) cans tomato paste",
               "2 (6.5 ounce) cans canned tomato sauce",
               "1/2 cup water",
               "2 tablespoons white sugar",
               "1 1/2 teaspoons dried basil leaves",
               "1/2 teaspoon fennel seeds",
               "1 teaspoon Italian seasoning",
               "1 tablespoon salt",
               "1/4 teaspoon ground black pepper",
               "4 tablespoons chopped fresh parsley",
               "12 lasagna noodles",
               "16 ounces ricotta cheese",
               "1 egg",
               "1/2 teaspoon salt",
               "3/4 pound mozzarella cheese, sliced",
               "3/4 cup grated Parmesan cheese"
          ],
          "instructions": "In a Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until well browned. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with sugar, basil, fennel seeds, Italian seasoning, 1 tablespoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally.\nBring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water.  In a mixing bowl, combine ricotta cheese with egg, remaining parsley, and 1/2 teaspoon salt.\nPreheat oven to 375  degrees F (190 degrees C).\nTo assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13 inch baking dish.  Arrange 6 noodles lengthwise over meat sauce. Spread with one half of the ricotta cheese mixture. Top with a third of mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese.  Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese.\nBake in preheated oven for 25 minutes. Remove foil, and bake an additional 25 minutes. Cool for 15 minutes before serving.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/3359675.jpg"
     },
     {
          "title": "Fluffy Pancakes",
          "url": "https://www.allrecipes.com/recipe/162760/fluffy-pancakes/",
          "rating": "4.82",
          "numreviews": "10917",
          "ingredients": [
               "3/4 cup milk",
               "2 tablespoons white vinegar",
               "1 cup all-purpose flour",
               "2 tablespoons white sugar",
               "1 teaspoon baking powder",
               "1/2 teaspoon baking soda",
               "1/2 teaspoon salt",
               "1 egg",
               "2 tablespoons butter, melted",
               "cooking spray"
          ],
          "instructions": "Combine milk with vinegar in a medium bowl and set aside for 5 minutes to \"sour\".\nCombine flour, sugar, baking powder, baking soda, and salt in a large mixing bowl. Whisk egg and butter into \"soured\" milk. Pour the flour mixture into the wet ingredients and whisk until lumps are gone.\nHeat a large skillet over medium heat, and coat with cooking spray. Pour 1/4 cupfuls of batter onto the skillet, and cook until bubbles appear on the surface. Flip with a spatula, and cook until browned on the other side.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/5079227.jpg"
     },
     {
          "title": "Best Chocolate Chip Cookies",
          "url": "https://www.allrecipes.com/recipe/10813/best-chocolate-chip-cookies/",
          "rating": "4.61",
          "numreviews": "11012",
          "ingredients": [
               "1 cup butter, softened",
               "1 cup white sugar",
               "1 cup packed brown sugar",
               "2 eggs",
               "2 teaspoons vanilla extract",
               "1 teaspoon baking soda",
               "2 teaspoons hot water",
               "1/2 teaspoon salt",
               "3 cups all-purpose flour",
               "2 cups semisweet chocolate chips",
               "1 cup chopped walnuts"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCream together the butter, white sugar, and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Dissolve baking soda in hot water.  Add to batter along with salt. Stir in flour, chocolate chips, and nuts. Drop by large spoonfuls onto ungreased pans.\nBake for about 10 minutes in the preheated oven, or until edges are nicely browned.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4462051.jpg"
     },
     {
          "title": "Good Old Fashioned Pancakes",
          "url": "https://www.allrecipes.com/recipe/21014/good-old-fashioned-pancakes/",
          "rating": "4.59",
          "numreviews": "11217",
          "ingredients": [
               "1 1/2 cups all-purpose flour",
               "3 1/2 teaspoons baking powder",
               "1 teaspoon salt",
               "1 tablespoon white sugar",
               "1 1/4 cups milk",
               "1 egg",
               "3 tablespoons butter, melted"
          ],
          "instructions": "In a large bowl, sift together the flour, baking powder, salt and sugar. Make a well in the center and pour in the milk, egg and melted butter; mix until smooth.\nHeat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4948036.jpg"
     },
     {
          "title": "Banana Banana Bread",
          "url": "https://www.allrecipes.com/recipe/20144/banana-banana-bread/",
          "rating": "4.58",
          "numreviews": "10716",
          "ingredients": [
               "2 cups all-purpose flour",
               "1 teaspoon baking soda",
               "1/4 teaspoon salt",
               "1/2 cup butter",
               "3/4 cup brown sugar",
               "2 eggs, beaten",
               "2 1/3 cups mashed overripe bananas"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.\nIn a large bowl, combine flour, baking soda and salt. In a separate bowl, cream together butter and brown sugar. Stir in eggs and mashed bananas until well blended. Stir banana mixture into flour mixture; stir just to moisten. Pour batter into prepared loaf pan.\nBake in preheated oven for 60 to 65 minutes, until a toothpick inserted into center of the loaf comes out clean. Let bread cool in pan for 10 minutes, then turn out onto a wire rack.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4565477.jpg"
     },
     {
          "title": "Delicious Ham and Potato Soup",
          "url": "https://www.allrecipes.com/recipe/56927/delicious-ham-and-potato-soup/",
          "rating": "4.84",
          "numreviews": "10201",
          "ingredients": [
               "3 1/2 cups peeled and diced potatoes",
               "1/3 cup diced celery",
               "1/3 cup finely chopped onion",
               "3/4 cup diced cooked ham",
               "3 1/4 cups water",
               "2 tablespoons chicken bouillon granules",
               "1/2 teaspoon salt, or to taste",
               "1 teaspoon ground white or black pepper, or to taste",
               "5 tablespoons butter",
               "5 tablespoons all-purpose flour",
               "2 cups milk"
          ],
          "instructions": "Combine the potatoes, celery, onion, ham and water in a stockpot. Bring to a boil, then cook over medium heat until potatoes are tender, about 10 to 15 minutes. Stir in the chicken bouillon, salt and pepper.\nIn a separate saucepan, melt butter over medium-low heat. Whisk in flour with a fork, and cook, stirring constantly until thick, about 1 minute. Slowly stir in milk as not to allow lumps to form until all of the milk has been added. Continue stirring over medium-low heat until thick, 4 to 5 minutes.\nStir the milk mixture into the stockpot, and cook soup until heated through. Serve immediately.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/962656.jpg"
     },
     {
          "title": "Banana Crumb Muffins",
          "url": "https://www.allrecipes.com/recipe/17652/banana-crumb-muffins/",
          "rating": "4.81",
          "numreviews": "10081",
          "ingredients": [
               "1 1/2 cups all-purpose flour",
               "1 teaspoon baking soda",
               "1 teaspoon baking powder",
               "1/2 teaspoon salt",
               "3 bananas, mashed",
               "3/4 cup white sugar",
               "1 egg, lightly beaten",
               "1/3 cup butter, melted",
               "1/3 cup packed brown sugar",
               "2 tablespoons all-purpose flour",
               "1/8 teaspoon ground cinnamon",
               "1 tablespoon butter"
          ],
          "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease 10 muffin cups, or line with muffin papers.\nIn a large bowl, mix together 1 1/2 cups flour, baking soda, baking powder and salt. In another bowl, beat together bananas, sugar, egg and melted butter. Stir the banana mixture into the flour mixture just until moistened. Spoon batter into prepared muffin cups.\nIn a small bowl, mix together brown sugar, 2 tablespoons flour and cinnamon. Cut in 1 tablespoon butter until mixture resembles coarse cornmeal. Sprinkle topping over muffins.\nBake in preheated oven for 18 to 20 minutes, until a toothpick inserted into center of a muffin comes out clean.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/428420.jpg"
     },
     {
          "title": "Apple Pie by Grandma Ople",
          "url": "https://www.allrecipes.com/recipe/12682/apple-pie-by-grandma-ople/",
          "rating": "4.78",
          "numreviews": "10432",
          "ingredients": [
               "1 recipe pastry for a 9 inch double crust pie",
               "1/2 cup unsalted butter",
               "3 tablespoons all-purpose flour",
               "1/4 cup water",
               "1/2 cup white sugar",
               "1/2 cup packed brown sugar",
               "8 Granny Smith apples - peeled, cored and sliced"
          ],
          "instructions": "Preheat oven to 425 degrees F (220 degrees C). Melt the butter in a saucepan. Stir in flour to form a paste. Add water, white sugar and brown sugar, and bring to a boil. Reduce temperature and let simmer.\nPlace the bottom crust in your pan. Fill with apples, mounded slightly. Cover with a lattice work crust.  Gently pour the sugar and butter liquid over the crust.  Pour slowly so that it does not run off.\nBake 15 minutes in the preheated oven. Reduce the temperature to 350 degrees F (175 degrees C). Continue baking for 35 to 45 minutes, until apples are soft.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/736203.jpg"
     },
     {
          "title": "To Die For Blueberry Muffins",
          "url": "https://www.allrecipes.com/recipe/6865/to-die-for-blueberry-muffins/",
          "rating": "4.64",
          "numreviews": "9776",
          "ingredients": [
               "1 1/2 cups all-purpose flour",
               "3/4 cup white sugar",
               "1/2 teaspoon salt",
               "2 teaspoons baking powder",
               "1/3 cup vegetable oil",
               "1 egg",
               "1/3 cup milk",
               "1 cup fresh blueberries",
               "1/2 cup white sugar",
               "1/3 cup all-purpose flour",
               "1/4 cup butter, cubed",
               "1 1/2 teaspoons ground cinnamon"
          ],
          "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease muffin cups or line with muffin liners.\nCombine 1 1/2 cups flour, 3/4 cup sugar, salt and baking powder. Place vegetable oil into a 1 cup measuring cup; add the egg and enough milk to fill the cup. Mix this with flour mixture. Fold in blueberries. Fill muffin cups right to the top, and sprinkle with crumb topping mixture.\nTo Make Crumb Topping: Mix together 1/2 cup sugar, 1/3 cup flour, 1/4 cup butter,  and 1 1/2 teaspoons cinnamon. Mix with fork, and sprinkle over muffins before baking.\nBake for 20 to 25 minutes in the preheated oven, or until done.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/662790.jpg"
     },
     {
          "title": "Chicken Pot Pie IX",
          "url": "https://www.allrecipes.com/recipe/26317/chicken-pot-pie-ix/",
          "rating": "4.81",
          "numreviews": "8505",
          "ingredients": [
               "1 pound skinless, boneless chicken breast halves - cubed",
               "1 cup sliced carrots",
               "1 cup frozen green peas",
               "1/2 cup sliced celery",
               "1/3 cup butter",
               "1/3 cup chopped onion",
               "1/3 cup all-purpose flour",
               "1/2 teaspoon salt",
               "1/4 teaspoon black pepper",
               "1/4 teaspoon celery seed",
               "1 3/4 cups chicken broth",
               "2/3 cup milk",
               "2 (9 inch) unbaked pie crusts"
          ],
          "instructions": "Preheat oven to 425 degrees F (220 degrees C.)\nIn a saucepan, combine chicken, carrots, peas, and celery. Add water to cover and boil for 15 minutes. Remove from heat, drain and set aside.\nIn the saucepan over medium heat, cook onions in butter until soft and translucent. Stir in flour, salt, pepper, and celery seed. Slowly stir in chicken broth and milk. Simmer over medium-low heat until thick. Remove from heat and set aside.\nPlace the chicken mixture in bottom pie crust. Pour hot liquid mixture over. Cover with top crust, seal edges, and cut away excess dough. Make several small slits in the top to allow steam to escape.\nBake in the preheated oven for 30 to 35 minutes, or until pastry is golden brown and filling is bubbly. Cool for 10 minutes before serving.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4535759.jpg"
     },
     {
          "title": "Best Brownies",
          "url": "https://www.allrecipes.com/recipe/10549/best-brownies/",
          "rating": "4.54",
          "numreviews": "9073",
          "ingredients": [
               "1/2 cup butter",
               "1 cup white sugar",
               "2 eggs",
               "1 teaspoon vanilla extract",
               "1/3 cup unsweetened cocoa powder",
               "1/2 cup all-purpose flour",
               "1/4 teaspoon salt",
               "1/4 teaspoon baking powder",
               "Frosting:",
               "3 tablespoons butter, softened",
               "3 tablespoons unsweetened cocoa powder",
               "1 tablespoon honey",
               "1 teaspoon vanilla extract",
               "1 cup confectioners' sugar"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8-inch square pan.\nIn a large saucepan, melt 1/2 cup butter. Remove from heat, and stir in sugar, eggs, and 1 teaspoon vanilla. Beat in 1/3 cup cocoa, 1/2 cup flour, salt, and baking powder. Spread batter into prepared pan.\nBake in preheated oven for 25 to 30 minutes. Do not overcook.\nTo Make Frosting:  Combine 3 tablespoons softened butter, 3 tablespoons cocoa, honey, 1 teaspoon vanilla extract, and 1 cup confectioners' sugar. Stir until smooth. Frost brownies while they are still warm.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/3850414.jpg"
     },
     {
          "title": "Best Big, Fat, Chewy Chocolate Chip Cookie",
          "url": "https://www.allrecipes.com/recipe/25037/best-big-fat-chewy-chocolate-chip-cookie/",
          "rating": "4.63",
          "numreviews": "8865",
          "ingredients": [
               "2 cups all-purpose flour",
               "1/2 teaspoon baking soda",
               "1/2 teaspoon salt",
               "3/4 cup unsalted butter, melted",
               "1 cup packed brown sugar",
               "1/2 cup white sugar",
               "1 tablespoon vanilla extract",
               "1 egg",
               "1 egg yolk",
               "2 cups semisweet chocolate chips"
          ],
          "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Grease cookie sheets or line with parchment paper.\nSift together the flour, baking soda and salt; set aside.\nIn a medium bowl, cream together the melted butter, brown sugar and white sugar until well blended. Beat in the vanilla, egg, and egg yolk until light and creamy. Mix in the sifted ingredients until just blended. Stir in the chocolate chips by hand using a wooden spoon. Drop cookie dough 1/4 cup at a time onto the prepared cookie sheets. Cookies should be about 3 inches apart.\nBake for 15 to 17 minutes in the preheated oven, or until the edges are lightly toasted. Cool on baking sheets for a few minutes before transferring to wire racks to cool completely.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/1107530.jpg"
     },
     {
          "title": "Award Winning Soft Chocolate Chip Cookies",
          "url": "https://www.allrecipes.com/recipe/15004/award-winning-soft-chocolate-chip-cookies/",
          "rating": "4.66",
          "numreviews": "8336",
          "ingredients": [
               "4 1/2 cups all-purpose flour",
               "2 teaspoons baking soda",
               "2 cups butter, softened",
               "1 1/2 cups packed brown sugar",
               "1/2 cup white sugar",
               "2 (3.4 ounce) packages instant vanilla pudding mix",
               "4 eggs",
               "2 teaspoons vanilla extract",
               "4 cups semisweet chocolate chips",
               "2 cups chopped walnuts (optional)"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Sift together the flour and baking soda, set aside.\nIn a large bowl, cream together the butter, brown sugar, and white sugar. Beat in the instant pudding mix until blended. Stir in the eggs and vanilla. Blend in the flour mixture. Finally, stir in the chocolate chips and nuts. Drop cookies by rounded spoonfuls onto ungreased cookie sheets.\nBake for 10 to 12 minutes in the preheated oven. Edges should be golden brown.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4538829.jpg"
     },
     {
          "title": "The Best Rolled Sugar Cookies",
          "url": "https://www.allrecipes.com/recipe/10402/the-best-rolled-sugar-cookies/",
          "rating": "4.43",
          "numreviews": "8226",
          "ingredients": [
               "1 1/2 cups butter, softened",
               "2 cups white sugar",
               "4 eggs",
               "1 teaspoon vanilla extract",
               "5 cups all-purpose flour",
               "2 teaspoons baking powder",
               "1 teaspoon salt"
          ],
          "instructions": "In a large bowl, cream together butter and sugar until smooth. Beat in eggs and vanilla. Stir in the  flour, baking powder, and salt. Cover, and chill dough for at least one hour (or overnight).\nPreheat oven to 400 degrees F (200 degrees C). Roll out dough on floured surface 1/4 to 1/2 inch thick. Cut into shapes with any cookie cutter. Place cookies 1 inch apart on ungreased cookie sheets.\nBake 6 to 8 minutes in preheated oven. Cool completely.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4518835.jpg"
     },
     {
          "title": "Broiled Tilapia Parmesan",
          "url": "https://www.allrecipes.com/recipe/50644/broiled-tilapia-parmesan/",
          "rating": "4.71",
          "numreviews": "7119",
          "ingredients": [
               "1/2 cup Parmesan cheese",
               "1/4 cup butter, softened",
               "3 tablespoons mayonnaise",
               "2 tablespoons fresh lemon juice",
               "1/4 teaspoon dried basil",
               "1/4 teaspoon ground black pepper",
               "1/8 teaspoon onion powder",
               "1/8 teaspoon celery salt",
               "2 pounds tilapia fillets"
          ],
          "instructions": "Preheat your oven's broiler. Grease a broiling pan or line pan with aluminum foil.\nIn a small bowl, mix together the Parmesan cheese, butter, mayonnaise and lemon juice. Season with dried basil, pepper, onion powder and celery salt. Mix well and set aside.\nArrange fillets in a single layer on the prepared pan. Broil a few inches from the heat for 2 to 3 minutes. Flip the fillets over and broil for a couple more minutes. Remove the fillets from the oven and cover them with the Parmesan cheese mixture on the top side. Broil for 2 more minutes or until the topping is browned and fish flakes easily with a fork. Be careful not to over cook the fish.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/687910.jpg"
     },
     {
          "title": "Awesome Slow Cooker Pot Roast",
          "url": "https://www.allrecipes.com/recipe/16066/awesome-slow-cooker-pot-roast/",
          "rating": "4.64",
          "numreviews": "6980",
          "ingredients": [
               "2 (10.75 ounce) cans condensed cream of mushroom soup",
               "1 (1 ounce) package dry onion soup mix",
               "1 1/4 cups water",
               "5 1/2 pounds pot roast"
          ],
          "instructions": "In a slow cooker, mix cream of mushroom soup, dry onion soup mix and water. Place pot roast in slow cooker and coat with soup mixture.\nCook on High setting for 3 to 4 hours, or on Low setting for 8 to 9 hours.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/2287775.jpg"
     },
     {
          "title": "Slow Cooker Chicken and Dumplings",
          "url": "https://www.allrecipes.com/recipe/8941/slow-cooker-chicken-and-dumplings/",
          "rating": "4.37",
          "numreviews": "6935",
          "ingredients": [
               "4 skinless, boneless chicken breast halves",
               "2 tablespoons butter",
               "2 (10.75 ounce) cans condensed cream of chicken soup",
               "1 onion, finely diced",
               "2 (10 ounce) packages refrigerated biscuit dough, torn into pieces"
          ],
          "instructions": "Place the chicken, butter, soup, and onion in a slow cooker, and fill with enough water to cover.\nCover, and cook for 5 to 6 hours on High. About 30 minutes before serving, place the torn biscuit dough in the slow cooker. Cook until the dough is no longer raw in the center.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/806223.jpg"
     },
     {
          "title": "Downeast Maine Pumpkin Bread",
          "url": "https://www.allrecipes.com/recipe/6820/downeast-maine-pumpkin-bread/",
          "rating": "4.81",
          "numreviews": "7158",
          "ingredients": [
               "1 (15 ounce) can pumpkin puree",
               "4 eggs",
               "1 cup vegetable oil",
               "2/3 cup water",
               "3 cups white sugar",
               "3 1/2 cups all-purpose flour",
               "2 teaspoons baking soda",
               "1 1/2 teaspoons salt",
               "1 teaspoon ground cinnamon",
               "1 teaspoon ground nutmeg",
               "1/2 teaspoon ground cloves",
               "1/4 teaspoon ground ginger"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 7x3 inch loaf pans.\nIn a large bowl, mix together pumpkin puree, eggs, oil, water and sugar until well blended. In a separate bowl, whisk together the flour, baking soda, salt, cinnamon, nutmeg, cloves and ginger. Stir the dry ingredients into the pumpkin mixture until just blended. Pour into the prepared pans.\nBake for about 50 minutes in the preheated oven. Loaves are done when toothpick inserted in center comes out clean.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4567827.jpg"
     },
     {
          "title": "Mom's Zucchini Bread",
          "url": "https://www.allrecipes.com/recipe/6698/moms-zucchini-bread/",
          "rating": "4.76",
          "numreviews": "7184",
          "ingredients": [
               "3 cups all-purpose flour",
               "1 teaspoon salt",
               "1 teaspoon baking soda",
               "1 teaspoon baking powder",
               "1 tablespoon ground cinnamon",
               "3 eggs",
               "1 cup vegetable oil",
               "2 1/4 cups white sugar",
               "3 teaspoons vanilla extract",
               "2 cups grated zucchini",
               "1 cup chopped walnuts"
          ],
          "instructions": "Grease and flour two 8 x 4 inch pans.  Preheat oven to 325 degrees F (165 degrees C).\nSift flour, salt, baking powder, soda, and cinnamon together in a bowl.\nBeat eggs, oil, vanilla, and sugar together in a large bowl.  Add sifted ingredients to the creamed mixture, and beat well.  Stir in zucchini and nuts until well combined.  Pour batter into prepared pans.\nBake for 40 to 60 minutes, or until tester inserted in the center comes out clean.  Cool in pan on rack for 20 minutes.  Remove bread from pan, and completely cool.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/1037957.jpg"
     },
     {
          "title": "Brown Sugar Meatloaf",
          "url": "https://www.allrecipes.com/recipe/25203/brown-sugar-meatloaf/",
          "rating": "4.58",
          "numreviews": "6417",
          "ingredients": [
               "1/2 cup packed brown sugar",
               "1/2 cup ketchup",
               "1 1/2 pounds lean ground beef",
               "3/4 cup milk",
               "2 eggs",
               "1 1/2 teaspoons salt",
               "1/4 teaspoon ground black pepper",
               "1 small onion, chopped",
               "1/4 teaspoon ground ginger",
               "3/4 cup finely crushed saltine cracker crumbs"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 5x9 inch loaf pan.\nPress the brown sugar in the bottom of the prepared loaf pan and spread the ketchup over the sugar.\nIn a mixing bowl, mix thoroughly all remaining ingredients and shape into a loaf. Place on top of the ketchup.\nBake in preheated oven for 1 hour or until juices are clear.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/2573174.jpg"
     },
     {
          "title": "Summer Special Shrimp and Fruit Fried Rice",
          "url": "https://www.allrecipes.com/recipe/166862/summer-special-shrimp-and-fruit-fried-rice/",
          "rating": "4.50",
          "numreviews": "10",
          "ingredients": [
               "1 tablespoon vegetable oil, divided",
               "2 eggs, beaten",
               "1/2 pound peeled and deveined medium shrimp",
               "1 (1 inch) piece fresh ginger root, minced",
               "2 red onions, sliced",
               "3 green chile peppers, chopped",
               "2/3 cup fresh pineapple, diced",
               "1/2 cup orange segments",
               "6 walnuts, chopped",
               "2 cups cold, cooked white rice",
               "1 tablespoon soy sauce",
               "2 tablespoons chopped fresh cilantro",
               "salt and pepper to taste"
          ],
          "instructions": "Heat 1 teaspoon of the vegetable oil in a wok over medium-high heat. Pour in the onions, and cook until just set; set aside. Increase the heat to high, and pour another 1 teaspoon of oil to the wok. Stir in the shrimp, and cook until the shrimp turn pink, and are no longer translucent in the center, about 3 minutes; set aside.\nWipe out the wok, and heat the remaining teaspoon of oil over high heat. Stir in the ginger, and cook quickly for a few seconds until the ginger begins to turn golden brown. Stir in the onion and chile peppers; cook for a minute or two until the onions begin to soften and turn brown around the edges. Add the pineapple and oranges, and gently cook until the pineapple is hot.\nStir in the rice, walnuts, and soy sauce. Stir for a few minutes until the rice is hot. Fold in the egg, shrimp, and cilantro. Season to taste with salt and pepper, and cook to reheat.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/1078508.jpg"
     },
     {
          "title": "Strawberry-Rhubarb Compote",
          "url": "https://www.allrecipes.com/recipe/274342/strawberry-rhubarb-compote/",
          "rating": "0.00",
          "numreviews": "0",
          "ingredients": [
               "2 cups chopped fresh strawberries",
               "2 cups chopped rhubarb",
               "1/3 cup brown sugar",
               "1/8 teaspoon salt"
          ],
          "instructions": "Combine chopped strawberries and rhubarb in a saucepan. Add sugar and salt; stir to coat evenly. Let sit until fruit has released its juices, about 10 minutes.\nBring fruit mixture to a light boil over medium heat. Reduce heat to medium-low and simmer, stirring occasionally, until fruit is soft and mixture has thickened, about 20 minutes. Remove from heat and let cool, about 30 minutes. Mixture will further thicken upon cooling. Place in a jar or storage container and refrigerate for up to a week.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6750673.jpg"
     },
     {
          "title": "Sour Cream Blueberry Muffins ",
          "url": "https://www.allrecipes.com/recipe/274332/sour-cream-blueberry-muffins/",
          "rating": "0.00",
          "numreviews": "0",
          "ingredients": [
               "cooking spray",
               "Crumb Topping:",
               "1/2 cup all-purpose flour",
               "1/4 cup brown sugar",
               "1/2 teaspoon ground cinnamon",
               "1/4 teaspoon salt",
               "1/4 cup butter, softened",
               "Muffins:",
               "2 cups all-purpose flour",
               "3 teaspoons baking powder",
               "1 teaspoon cinnamon",
               "1/4 teaspoon salt",
               "2 large eggs",
               "1/2 cup granulated sugar",
               "1/2 cup brown sugar",
               "1 cup sour cream",
               "1/2 cup vegetable oil",
               "1 teaspoon vanilla extract",
               "2 cups blueberries",
               "1 tablespoon all-purpose flour"
          ],
          "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Spray 16 muffin cups with cooking spray or line cups with paper liners.\nCombine 1/2 cup flour, 1/4 cup brown sugar, 1/2 teaspoon cinnamon, and 1/4 teaspoon salt in a small bowl. Cut butter into the flour mixture until it is crumbly. Set crumb topping aside.\nWhisk 2 cups flour, baking powder, 1 teaspoon cinnamon, and 1/4 teaspoon salt together in a large bowl, making a well in the center. Whisk eggs, granulated sugar, and 1/2 cup brown sugar together in a separate bowl. Stir in sour cream, vegetable oil, and vanilla extract until well combined. Pour into the well in the flour mixture and stir until batter is just combined without overmixing. Toss blueberries with 1 tablespoon flour in a small bowl and gently fold into the batter.\nSpoon batter into the prepared muffin cups, filling each 3/4 full. Top each muffin with about 1 tablespoon of crumb mixture.\nBake in the preheated oven until tops spring back when lightly pressed and muffins are lightly browned, 18 to 22 minutes. A toothpick inserted into the center of the muffins should come out clean. Cool in the tins for 10 minutes. Transfer to a wire rack to cool completely.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6752952.jpg"
     },
     {
          "title": "Armenian Stuffed Eggplant (Imam Bayildi)",
          "url": "https://www.allrecipes.com/recipe/274390/armenian-stuffed-eggplant-imam-bayildi/",
          "rating": "0.00",
          "numreviews": "0",
          "ingredients": [
               "2 large eggplants",
               "1/4 cup olive oil, divided",
               "1 red bell pepper, cut into 1-inch strips",
               "1/2 onion, sliced",
               "3 cloves garlic, minced",
               "2 tomatoes, chopped",
               "1 (8 ounce) can tomato sauce with no salt added",
               "1/8 teaspoon salt",
               "1/8 teaspoon ground black pepper",
               "1 pinch chopped fresh parsley, or to taste"
          ],
          "instructions": "Preheat the oven to 450 degrees F (230 degrees C).\nCut eggplants in 1/2, then cut each 1/2 into thirds, leaving 12 eggplant spears total. Place on a baking sheet and brush with 2 tablespoons olive oil.\nRoast in the preheated oven until fork tender, 15 to 20 minutes. Reduce the oven temperature to 350 degrees F (175 degrees C).\nWhile eggplants are cooking, heat remaining 2 tablespoons olive oil over medium heat in a medium to large pan. Add bell pepper, onion, and garlic to the hot pan and cook until onions become tender, 5 to 7 minutes. Stir in tomatoes and cook until most of the liquid has evaporated, 2 to 3 minutes. Set aside to cool.\nRemove eggplants from the oven and let cool slightly, 5 to 10 minutes. Transfer eggplants to a 9x13-inch baking dish. Slice each spear vertically using a fork and knife, being careful not to cut through skin. Pry each open and fill with 2 to 3 tablespoons of tomato filling. Cover with tomato sauce.\nBake in the preheated oven until bubbling, about 30 minutes. Season with salt and pepper. Garnish with parsley.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6779557.jpg"
     },
     {
          "title": "Savory Western Crepes",
          "url": "https://www.allrecipes.com/recipe/274293/savory-western-crepes/",
          "rating": "0.00",
          "numreviews": "0",
          "ingredients": [
               "Crepe Batter:",
               "1 1/2 cups milk",
               "1 cup all-purpose flour",
               "2 large eggs",
               "2 tablespoons chopped fresh cilantro",
               "1 tablespoon melted butter",
               "2 teaspoons chile-garlic sauce (such as Sriracha(R))",
               "Crepe Filling:",
               "8 large eggs",
               "1/4 cup milk",
               "1/2 cup shredded Cheddar cheese",
               "salt and freshly ground black pepper to taste",
               "1 teaspoon olive oil",
               "1/3 cup diced onion",
               "1/3 cup diced red bell pepper",
               "3 tablespoons diced jalapeno pepper (optional)",
               "1/2 cup chopped ham",
               "2 tablespoons melted butter, or as needed, divided"
          ],
          "instructions": "Combine milk, flour, eggs, cilantro, melted butter, and chile-garlic sauce in a blender. Blend until smooth and very thin, about 1 minute. Set batter aside to rest for at least 30 minutes.\nHeat a crepe pan or small skillet over medium heat. Brush 1 tablespoon melted butter into the pan using a pastry brush and add 1/2 cup of crepe batter. Pick up the pan, tipping and rotating so batter forms a round shape and evenly coats the entire bottom of the pan. Return the pan to the burner and cook until small brown spots appear on the bottom of the crepe, 1 to 2 minutes.\nLoosen crepe carefully using a spatula and gently flip it to brown the other side; cook for 30 to 60 seconds. Slide cooked crepe onto a plate. Repeat to cook additional crepes, adding more butter if needed, and stacking crepes on top of the first.\nWhisk eggs and milk in a large bowl until well blended. Stir in Cheddar cheese, salt, and pepper.\nHeat oil in a skillet over medium heat. Add onion, bell pepper, and jalapeno pepper and cook until tender, about 3 minutes. Stir in ham and continue cooking for another 2 minutes. Reduce heat to low and stir 1 tablespoon melted butter into the skillet. Add egg mixture and cook, stirring until eggs are scrambled and wet, but no longer runny, 3 to 5 minutes. Remove from heat.\nSpoon about 1/4 cup of the egg mixture across the lower 1/3 of a crepe and roll up like a jelly roll. Repeat with remaining crepes and filling.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6732798.jpg"
     },
     {
          "title": "Lemon-Blueberry Scones with Blueberry Glaze",
          "url": "https://www.allrecipes.com/recipe/274317/lemon-blueberry-scones-with-blueberry-glaze/",
          "rating": "0.00",
          "numreviews": "0",
          "ingredients": [
               "1 1/4 cups whole wheat flour",
               "1 cup all-purpose flour",
               "1/4 cup white sugar",
               "2 1/2 teaspoons baking powder",
               "1 teaspoon ground cardamom",
               "1 teaspoon lemon zest",
               "1/2 teaspoon baking soda",
               "1/2 teaspoon salt",
               "1/4 teaspoon ground ginger",
               "1/2 cup unsalted butter, frozen",
               "1/2 cup whole-milk Greek yogurt",
               "3 tablespoons heavy cream",
               "1 egg",
               "2 teaspoons vanilla extract",
               "1 cup frozen blueberries, unthawed",
               "Egg Wash:",
               "1 egg",
               "1 teaspoon water",
               "Glaze:",
               "1/4 cup frozen blueberries, thawed",
               "2/3 cup confectioners' sugar",
               "1 tablespoon lemon juice"
          ],
          "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Line a large baking sheet with parchment paper.\nCombine whole wheat flour, all-purpose flour, sugar, baking powder, cardamom, lemon zest, baking soda, salt, and ginger in a large bowl. Grate in frozen butter using a box grater and toss until mixture resembles coarse crumbs.\nMix yogurt, cream, egg, and vanilla extract together in a small bowl. Add to the flour mixture to form a crumbly dough, stirring just until no dry clumps of flour remain. Stir in unthawed blueberries.\nPour crumbly dough onto the parchment-lined baking sheet. Press dough together firmly until it forms a cohesive 8-inch circle. Flatten top to ensure the circle is even. Cut into 8 triangular pieces. Arrange the pieces 1 inch apart on the same parchment-lined pan.\nWhisk egg and water together in a small bowl for the egg wash. Gently brush over the top of each scone.\nBake scones in the preheated oven until tops are golden brown, 20 to 25 minutes. Let cool completely, about 30 minutes.\nUse the back of a wooden spoon to press thawed blueberries through a fine-mesh strainer into a medium bowl to extract 2 or 3 tablespoons of juice. Discards skins and seeds. Whisk confectioners' sugar and lemon juice into the blueberry juice until smooth. Drizzle blueberry glaze over cooled scones.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6765602.jpg"
     },
     {
          "title": "Garlic Shrimp Kabobs",
          "url": "https://www.allrecipes.com/recipe/273793/garlic-shrimp-kabobs/",
          "rating": "5.00",
          "numreviews": "1",
          "ingredients": [
               "1 pound frozen shrimp, thawed and peeled",
               "1/4 cup olive oil",
               "1 tablespoon minced garlic",
               "2 teaspoons lemon juice",
               "1/4 teaspoon pepper",
               "1 pinch finely chopped parsley",
               "metal skewers",
               "cooking spray"
          ],
          "instructions": "Rinse and dry shrimp.\nWhisk olive oil, garlic, lemon juice, pepper, and parsley together in a bowl and pour into a large resealable plastic bag. Add shrimp, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 2 hours.\nPreheat an outdoor grill for medium heat and lightly oil the grate. Lightly coat metal skewers with cooking spray.\nRemove shrimp from the marinade and shake off excess. Discard the remaining marinade. Place about 5 shrimp on each skewer.\nCook on the preheated grill until shrimp are bright pink on the outside and the meat is opaque, about 5 minutes; do not overcook.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6795468.jpg"
     },
     {
          "title": "Strawberry Lemonade Cake",
          "url": "https://www.allrecipes.com/recipe/274413/strawberry-lemonade-cake/",
          "rating": "0.00",
          "numreviews": "0",
          "ingredients": [
               "Strawberry Reduction:",
               "5 cups fresh strawberries, hulled and sliced",
               "1/4 cup white sugar",
               "1 tablespoon lemon juice",
               "Cake:",
               "3 cups all-purpose flour",
               "1 teaspoon baking soda",
               "1 teaspoon baking powder",
               "1/2 teaspoon salt",
               "2 cups white sugar",
               "1 cup unsalted butter, softened",
               "4 eggs, room temperature",
               "1 1/2 tablespoons lemon zest",
               "1 teaspoon vanilla extract",
               "3/4 cup sour cream, room temperature",
               "1/4 cup lemon juice",
               "Frosting:",
               "1 1/2 cups unsalted butter, softened",
               "5 cups powdered sugar, or more as needed",
               "1 tablespoon lemon juice",
               "1 teaspoon vanilla extract",
               "1 teaspoon lemon zest",
               "1/4 teaspoon salt",
               "4 tablespoons heavy cream"
          ],
          "instructions": "Place strawberries, sugar, and lemon juice for the reduction into an electric blender and puree until smooth.\nPour strawberry mixture into a large saucepan and simmer over medium heat, stirring frequently, until reduced by 1/2, 20 to 25 minutes. Remove from heat and let cool to room temperature, 10 to 15 minutes. Reserve 1/2 cup plus 5 tablespoons for cake and frosting; remainder will be used as cake filling.\nPreheat the oven to 350 degrees F (175 degrees C). Grease two 9-inch cake pans and line with parchment paper.\nWhisk flour, baking soda, baking powder, and salt together in a medium bowl. Set aside.\nBeat sugar and butter using an electric mixer in a large bowl until creamy. Beat in eggs one at a time, mixing thoroughly after each addition. Mix in lemon zest and vanilla extract. Stir in 1/3 of the flour mixture until just combined. Stir in 1/2 of the sour cream, and 1/2 of the lemon juice. Repeat alternating additions of flour mixture and sour cream plus lemon juice until just combined, making sure not to overmix.\nPlace 1/2 of the batter into a separate bowl. Fold in 1/2 cup strawberry reduction. Place dollops of both lemon and strawberry-lemon batters alternately into the prepared cake pans. Swirl batters together with a butter knife.\nBake in the preheated oven until a toothpick inserted into the center of each cake comes out clean, 30 to 35 minutes. Remove from the oven and let cool for 10 minutes in the pans before removing and transferring cakes to a wire rack to cool completely, 15 to 30 minutes.\nWhile cakes are cooling, beat butter for frosting with an electric mixer in a mixing bowl until light and fluffy. Beat in powdered sugar 1 cup at a time until incorporated. Mix in 5 tablespoons strawberry reduction, lemon juice, vanilla extract, lemon zest, and salt until combined. Pour in heavy cream and beat until frosting is smooth and fluffy, 2 to 3 minutes. Add additional powdered sugar if too thin, or additional heavy cream if too thick, 1 tablespoon at a time, until desired consistency is reached.\nPlace 1 cooled cake layer on a serving platter and cover top with a thin layer of frosting. Pipe a border around the edge of the cake layer using a piping bag filled with frosting, leaving the center open. Pour remaining strawberry reduction into the center of the border, making sure it doesn't overflow over the sides. Place second cake layer on top and continue to frost as desired. Keep refrigerated until ready to serve.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6799549.jpg"
     },
     {
          "title": "Bucatini Cacio e Pepe (Roman Sheep Herder's Pasta)",
          "url": "https://www.allrecipes.com/recipe/274411/bucatini-cacio-e-pepe-roman-sheep-herders-pasta/",
          "rating": "0.00",
          "numreviews": "0",
          "ingredients": [
               "1 teaspoon salt",
               "1 pound bucatini (dry)",
               "2 cups finely grated Pecorino Romano cheese",
               "1 1/2 tablespoons freshly ground black pepper, or more to taste"
          ],
          "instructions": "Bring a large pot of water to a boil and add salt. Cook bucatini in the boiling water, stirring occasionally, until tender yet firm to the bite, 8 to 10 minutes.\nPlace grated Pecorino Romano cheese into a large glass bowl and mix with a fork to make sure the cheese contains no lumps.\nOnce the bucatini are al dente, lift them out with a spaghetti fork or tongs and put them directly into the bowl with the cheese. Do not allow the water to drain too much.\nAdd one ladle of pasta water to the bowl. Stir the bucatini around until a cream has formed. Add more pasta water, little by little, until a thick cream has formed. Sprinkle freshly ground pepper over the pasta. Toss and serve immediately.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/2253389.jpg"
     },
     {
          "title": "World's Best Lasagna",
          "url": "https://www.allrecipes.com/recipe/23600/worlds-best-lasagna/",
          "rating": "4.79",
          "numreviews": "12260",
          "ingredients": [
               "1 pound sweet Italian sausage",
               "3/4 pound lean ground beef",
               "1/2 cup minced onion",
               "2 cloves garlic, crushed",
               "1 (28 ounce) can crushed tomatoes",
               "2 (6 ounce) cans tomato paste",
               "2 (6.5 ounce) cans canned tomato sauce",
               "1/2 cup water",
               "2 tablespoons white sugar",
               "1 1/2 teaspoons dried basil leaves",
               "1/2 teaspoon fennel seeds",
               "1 teaspoon Italian seasoning",
               "1 tablespoon salt",
               "1/4 teaspoon ground black pepper",
               "4 tablespoons chopped fresh parsley",
               "12 lasagna noodles",
               "16 ounces ricotta cheese",
               "1 egg",
               "1/2 teaspoon salt",
               "3/4 pound mozzarella cheese, sliced",
               "3/4 cup grated Parmesan cheese"
          ],
          "instructions": "In a Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until well browned. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with sugar, basil, fennel seeds, Italian seasoning, 1 tablespoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally.\nBring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water.  In a mixing bowl, combine ricotta cheese with egg, remaining parsley, and 1/2 teaspoon salt.\nPreheat oven to 375  degrees F (190 degrees C).\nTo assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13 inch baking dish.  Arrange 6 noodles lengthwise over meat sauce. Spread with one half of the ricotta cheese mixture. Top with a third of mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese.  Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese.\nBake in preheated oven for 25 minutes. Remove foil, and bake an additional 25 minutes. Cool for 15 minutes before serving.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/3359675.jpg"
     },
     {
          "title": "Fluffy Pancakes",
          "url": "https://www.allrecipes.com/recipe/162760/fluffy-pancakes/",
          "rating": "4.82",
          "numreviews": "10917",
          "ingredients": [
               "3/4 cup milk",
               "2 tablespoons white vinegar",
               "1 cup all-purpose flour",
               "2 tablespoons white sugar",
               "1 teaspoon baking powder",
               "1/2 teaspoon baking soda",
               "1/2 teaspoon salt",
               "1 egg",
               "2 tablespoons butter, melted",
               "cooking spray"
          ],
          "instructions": "Combine milk with vinegar in a medium bowl and set aside for 5 minutes to \"sour\".\nCombine flour, sugar, baking powder, baking soda, and salt in a large mixing bowl. Whisk egg and butter into \"soured\" milk. Pour the flour mixture into the wet ingredients and whisk until lumps are gone.\nHeat a large skillet over medium heat, and coat with cooking spray. Pour 1/4 cupfuls of batter onto the skillet, and cook until bubbles appear on the surface. Flip with a spatula, and cook until browned on the other side.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/5079227.jpg"
     },
     {
          "title": "Best Chocolate Chip Cookies",
          "url": "https://www.allrecipes.com/recipe/10813/best-chocolate-chip-cookies/",
          "rating": "4.61",
          "numreviews": "11012",
          "ingredients": [
               "1 cup butter, softened",
               "1 cup white sugar",
               "1 cup packed brown sugar",
               "2 eggs",
               "2 teaspoons vanilla extract",
               "1 teaspoon baking soda",
               "2 teaspoons hot water",
               "1/2 teaspoon salt",
               "3 cups all-purpose flour",
               "2 cups semisweet chocolate chips",
               "1 cup chopped walnuts"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCream together the butter, white sugar, and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Dissolve baking soda in hot water.  Add to batter along with salt. Stir in flour, chocolate chips, and nuts. Drop by large spoonfuls onto ungreased pans.\nBake for about 10 minutes in the preheated oven, or until edges are nicely browned.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4462051.jpg"
     },
     {
          "title": "Good Old Fashioned Pancakes",
          "url": "https://www.allrecipes.com/recipe/21014/good-old-fashioned-pancakes/",
          "rating": "4.59",
          "numreviews": "11217",
          "ingredients": [
               "1 1/2 cups all-purpose flour",
               "3 1/2 teaspoons baking powder",
               "1 teaspoon salt",
               "1 tablespoon white sugar",
               "1 1/4 cups milk",
               "1 egg",
               "3 tablespoons butter, melted"
          ],
          "instructions": "In a large bowl, sift together the flour, baking powder, salt and sugar. Make a well in the center and pour in the milk, egg and melted butter; mix until smooth.\nHeat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4948036.jpg"
     },
     {
          "title": "Banana Banana Bread",
          "url": "https://www.allrecipes.com/recipe/20144/banana-banana-bread/",
          "rating": "4.58",
          "numreviews": "10716",
          "ingredients": [
               "2 cups all-purpose flour",
               "1 teaspoon baking soda",
               "1/4 teaspoon salt",
               "1/2 cup butter",
               "3/4 cup brown sugar",
               "2 eggs, beaten",
               "2 1/3 cups mashed overripe bananas"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.\nIn a large bowl, combine flour, baking soda and salt. In a separate bowl, cream together butter and brown sugar. Stir in eggs and mashed bananas until well blended. Stir banana mixture into flour mixture; stir just to moisten. Pour batter into prepared loaf pan.\nBake in preheated oven for 60 to 65 minutes, until a toothpick inserted into center of the loaf comes out clean. Let bread cool in pan for 10 minutes, then turn out onto a wire rack.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4565477.jpg"
     },
     {
          "title": "Delicious Ham and Potato Soup",
          "url": "https://www.allrecipes.com/recipe/56927/delicious-ham-and-potato-soup/",
          "rating": "4.84",
          "numreviews": "10201",
          "ingredients": [
               "3 1/2 cups peeled and diced potatoes",
               "1/3 cup diced celery",
               "1/3 cup finely chopped onion",
               "3/4 cup diced cooked ham",
               "3 1/4 cups water",
               "2 tablespoons chicken bouillon granules",
               "1/2 teaspoon salt, or to taste",
               "1 teaspoon ground white or black pepper, or to taste",
               "5 tablespoons butter",
               "5 tablespoons all-purpose flour",
               "2 cups milk"
          ],
          "instructions": "Combine the potatoes, celery, onion, ham and water in a stockpot. Bring to a boil, then cook over medium heat until potatoes are tender, about 10 to 15 minutes. Stir in the chicken bouillon, salt and pepper.\nIn a separate saucepan, melt butter over medium-low heat. Whisk in flour with a fork, and cook, stirring constantly until thick, about 1 minute. Slowly stir in milk as not to allow lumps to form until all of the milk has been added. Continue stirring over medium-low heat until thick, 4 to 5 minutes.\nStir the milk mixture into the stockpot, and cook soup until heated through. Serve immediately.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/962656.jpg"
     },
     {
          "title": "Banana Crumb Muffins",
          "url": "https://www.allrecipes.com/recipe/17652/banana-crumb-muffins/",
          "rating": "4.81",
          "numreviews": "10081",
          "ingredients": [
               "1 1/2 cups all-purpose flour",
               "1 teaspoon baking soda",
               "1 teaspoon baking powder",
               "1/2 teaspoon salt",
               "3 bananas, mashed",
               "3/4 cup white sugar",
               "1 egg, lightly beaten",
               "1/3 cup butter, melted",
               "1/3 cup packed brown sugar",
               "2 tablespoons all-purpose flour",
               "1/8 teaspoon ground cinnamon",
               "1 tablespoon butter"
          ],
          "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease 10 muffin cups, or line with muffin papers.\nIn a large bowl, mix together 1 1/2 cups flour, baking soda, baking powder and salt. In another bowl, beat together bananas, sugar, egg and melted butter. Stir the banana mixture into the flour mixture just until moistened. Spoon batter into prepared muffin cups.\nIn a small bowl, mix together brown sugar, 2 tablespoons flour and cinnamon. Cut in 1 tablespoon butter until mixture resembles coarse cornmeal. Sprinkle topping over muffins.\nBake in preheated oven for 18 to 20 minutes, until a toothpick inserted into center of a muffin comes out clean.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/428420.jpg"
     },
     {
          "title": "Apple Pie by Grandma Ople",
          "url": "https://www.allrecipes.com/recipe/12682/apple-pie-by-grandma-ople/",
          "rating": "4.78",
          "numreviews": "10432",
          "ingredients": [
               "1 recipe pastry for a 9 inch double crust pie",
               "1/2 cup unsalted butter",
               "3 tablespoons all-purpose flour",
               "1/4 cup water",
               "1/2 cup white sugar",
               "1/2 cup packed brown sugar",
               "8 Granny Smith apples - peeled, cored and sliced"
          ],
          "instructions": "Preheat oven to 425 degrees F (220 degrees C). Melt the butter in a saucepan. Stir in flour to form a paste. Add water, white sugar and brown sugar, and bring to a boil. Reduce temperature and let simmer.\nPlace the bottom crust in your pan. Fill with apples, mounded slightly. Cover with a lattice work crust.  Gently pour the sugar and butter liquid over the crust.  Pour slowly so that it does not run off.\nBake 15 minutes in the preheated oven. Reduce the temperature to 350 degrees F (175 degrees C). Continue baking for 35 to 45 minutes, until apples are soft.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/736203.jpg"
     },
     {
          "title": "To Die For Blueberry Muffins",
          "url": "https://www.allrecipes.com/recipe/6865/to-die-for-blueberry-muffins/",
          "rating": "4.64",
          "numreviews": "9776",
          "ingredients": [
               "1 1/2 cups all-purpose flour",
               "3/4 cup white sugar",
               "1/2 teaspoon salt",
               "2 teaspoons baking powder",
               "1/3 cup vegetable oil",
               "1 egg",
               "1/3 cup milk",
               "1 cup fresh blueberries",
               "1/2 cup white sugar",
               "1/3 cup all-purpose flour",
               "1/4 cup butter, cubed",
               "1 1/2 teaspoons ground cinnamon"
          ],
          "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease muffin cups or line with muffin liners.\nCombine 1 1/2 cups flour, 3/4 cup sugar, salt and baking powder. Place vegetable oil into a 1 cup measuring cup; add the egg and enough milk to fill the cup. Mix this with flour mixture. Fold in blueberries. Fill muffin cups right to the top, and sprinkle with crumb topping mixture.\nTo Make Crumb Topping: Mix together 1/2 cup sugar, 1/3 cup flour, 1/4 cup butter,  and 1 1/2 teaspoons cinnamon. Mix with fork, and sprinkle over muffins before baking.\nBake for 20 to 25 minutes in the preheated oven, or until done.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/662790.jpg"
     },
     {
          "title": "Chicken Pot Pie IX",
          "url": "https://www.allrecipes.com/recipe/26317/chicken-pot-pie-ix/",
          "rating": "4.81",
          "numreviews": "8505",
          "ingredients": [
               "1 pound skinless, boneless chicken breast halves - cubed",
               "1 cup sliced carrots",
               "1 cup frozen green peas",
               "1/2 cup sliced celery",
               "1/3 cup butter",
               "1/3 cup chopped onion",
               "1/3 cup all-purpose flour",
               "1/2 teaspoon salt",
               "1/4 teaspoon black pepper",
               "1/4 teaspoon celery seed",
               "1 3/4 cups chicken broth",
               "2/3 cup milk",
               "2 (9 inch) unbaked pie crusts"
          ],
          "instructions": "Preheat oven to 425 degrees F (220 degrees C.)\nIn a saucepan, combine chicken, carrots, peas, and celery. Add water to cover and boil for 15 minutes. Remove from heat, drain and set aside.\nIn the saucepan over medium heat, cook onions in butter until soft and translucent. Stir in flour, salt, pepper, and celery seed. Slowly stir in chicken broth and milk. Simmer over medium-low heat until thick. Remove from heat and set aside.\nPlace the chicken mixture in bottom pie crust. Pour hot liquid mixture over. Cover with top crust, seal edges, and cut away excess dough. Make several small slits in the top to allow steam to escape.\nBake in the preheated oven for 30 to 35 minutes, or until pastry is golden brown and filling is bubbly. Cool for 10 minutes before serving.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4535759.jpg"
     },
     {
          "title": "Best Brownies",
          "url": "https://www.allrecipes.com/recipe/10549/best-brownies/",
          "rating": "4.54",
          "numreviews": "9073",
          "ingredients": [
               "1/2 cup butter",
               "1 cup white sugar",
               "2 eggs",
               "1 teaspoon vanilla extract",
               "1/3 cup unsweetened cocoa powder",
               "1/2 cup all-purpose flour",
               "1/4 teaspoon salt",
               "1/4 teaspoon baking powder",
               "Frosting:",
               "3 tablespoons butter, softened",
               "3 tablespoons unsweetened cocoa powder",
               "1 tablespoon honey",
               "1 teaspoon vanilla extract",
               "1 cup confectioners' sugar"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8-inch square pan.\nIn a large saucepan, melt 1/2 cup butter. Remove from heat, and stir in sugar, eggs, and 1 teaspoon vanilla. Beat in 1/3 cup cocoa, 1/2 cup flour, salt, and baking powder. Spread batter into prepared pan.\nBake in preheated oven for 25 to 30 minutes. Do not overcook.\nTo Make Frosting:  Combine 3 tablespoons softened butter, 3 tablespoons cocoa, honey, 1 teaspoon vanilla extract, and 1 cup confectioners' sugar. Stir until smooth. Frost brownies while they are still warm.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/3850414.jpg"
     },
     {
          "title": "Best Big, Fat, Chewy Chocolate Chip Cookie",
          "url": "https://www.allrecipes.com/recipe/25037/best-big-fat-chewy-chocolate-chip-cookie/",
          "rating": "4.63",
          "numreviews": "8865",
          "ingredients": [
               "2 cups all-purpose flour",
               "1/2 teaspoon baking soda",
               "1/2 teaspoon salt",
               "3/4 cup unsalted butter, melted",
               "1 cup packed brown sugar",
               "1/2 cup white sugar",
               "1 tablespoon vanilla extract",
               "1 egg",
               "1 egg yolk",
               "2 cups semisweet chocolate chips"
          ],
          "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Grease cookie sheets or line with parchment paper.\nSift together the flour, baking soda and salt; set aside.\nIn a medium bowl, cream together the melted butter, brown sugar and white sugar until well blended. Beat in the vanilla, egg, and egg yolk until light and creamy. Mix in the sifted ingredients until just blended. Stir in the chocolate chips by hand using a wooden spoon. Drop cookie dough 1/4 cup at a time onto the prepared cookie sheets. Cookies should be about 3 inches apart.\nBake for 15 to 17 minutes in the preheated oven, or until the edges are lightly toasted. Cool on baking sheets for a few minutes before transferring to wire racks to cool completely.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/1107530.jpg"
     },
     {
          "title": "Award Winning Soft Chocolate Chip Cookies",
          "url": "https://www.allrecipes.com/recipe/15004/award-winning-soft-chocolate-chip-cookies/",
          "rating": "4.66",
          "numreviews": "8336",
          "ingredients": [
               "4 1/2 cups all-purpose flour",
               "2 teaspoons baking soda",
               "2 cups butter, softened",
               "1 1/2 cups packed brown sugar",
               "1/2 cup white sugar",
               "2 (3.4 ounce) packages instant vanilla pudding mix",
               "4 eggs",
               "2 teaspoons vanilla extract",
               "4 cups semisweet chocolate chips",
               "2 cups chopped walnuts (optional)"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Sift together the flour and baking soda, set aside.\nIn a large bowl, cream together the butter, brown sugar, and white sugar. Beat in the instant pudding mix until blended. Stir in the eggs and vanilla. Blend in the flour mixture. Finally, stir in the chocolate chips and nuts. Drop cookies by rounded spoonfuls onto ungreased cookie sheets.\nBake for 10 to 12 minutes in the preheated oven. Edges should be golden brown.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4538829.jpg"
     },
     {
          "title": "The Best Rolled Sugar Cookies",
          "url": "https://www.allrecipes.com/recipe/10402/the-best-rolled-sugar-cookies/",
          "rating": "4.43",
          "numreviews": "8226",
          "ingredients": [
               "1 1/2 cups butter, softened",
               "2 cups white sugar",
               "4 eggs",
               "1 teaspoon vanilla extract",
               "5 cups all-purpose flour",
               "2 teaspoons baking powder",
               "1 teaspoon salt"
          ],
          "instructions": "In a large bowl, cream together butter and sugar until smooth. Beat in eggs and vanilla. Stir in the  flour, baking powder, and salt. Cover, and chill dough for at least one hour (or overnight).\nPreheat oven to 400 degrees F (200 degrees C). Roll out dough on floured surface 1/4 to 1/2 inch thick. Cut into shapes with any cookie cutter. Place cookies 1 inch apart on ungreased cookie sheets.\nBake 6 to 8 minutes in preheated oven. Cool completely.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4518835.jpg"
     },
     {
          "title": "Broiled Tilapia Parmesan",
          "url": "https://www.allrecipes.com/recipe/50644/broiled-tilapia-parmesan/",
          "rating": "4.71",
          "numreviews": "7119",
          "ingredients": [
               "1/2 cup Parmesan cheese",
               "1/4 cup butter, softened",
               "3 tablespoons mayonnaise",
               "2 tablespoons fresh lemon juice",
               "1/4 teaspoon dried basil",
               "1/4 teaspoon ground black pepper",
               "1/8 teaspoon onion powder",
               "1/8 teaspoon celery salt",
               "2 pounds tilapia fillets"
          ],
          "instructions": "Preheat your oven's broiler. Grease a broiling pan or line pan with aluminum foil.\nIn a small bowl, mix together the Parmesan cheese, butter, mayonnaise and lemon juice. Season with dried basil, pepper, onion powder and celery salt. Mix well and set aside.\nArrange fillets in a single layer on the prepared pan. Broil a few inches from the heat for 2 to 3 minutes. Flip the fillets over and broil for a couple more minutes. Remove the fillets from the oven and cover them with the Parmesan cheese mixture on the top side. Broil for 2 more minutes or until the topping is browned and fish flakes easily with a fork. Be careful not to over cook the fish.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/687910.jpg"
     },
     {
          "title": "Awesome Slow Cooker Pot Roast",
          "url": "https://www.allrecipes.com/recipe/16066/awesome-slow-cooker-pot-roast/",
          "rating": "4.64",
          "numreviews": "6980",
          "ingredients": [
               "2 (10.75 ounce) cans condensed cream of mushroom soup",
               "1 (1 ounce) package dry onion soup mix",
               "1 1/4 cups water",
               "5 1/2 pounds pot roast"
          ],
          "instructions": "In a slow cooker, mix cream of mushroom soup, dry onion soup mix and water. Place pot roast in slow cooker and coat with soup mixture.\nCook on High setting for 3 to 4 hours, or on Low setting for 8 to 9 hours.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/2287775.jpg"
     },
     {
          "title": "Slow Cooker Chicken and Dumplings",
          "url": "https://www.allrecipes.com/recipe/8941/slow-cooker-chicken-and-dumplings/",
          "rating": "4.37",
          "numreviews": "6935",
          "ingredients": [
               "4 skinless, boneless chicken breast halves",
               "2 tablespoons butter",
               "2 (10.75 ounce) cans condensed cream of chicken soup",
               "1 onion, finely diced",
               "2 (10 ounce) packages refrigerated biscuit dough, torn into pieces"
          ],
          "instructions": "Place the chicken, butter, soup, and onion in a slow cooker, and fill with enough water to cover.\nCover, and cook for 5 to 6 hours on High. About 30 minutes before serving, place the torn biscuit dough in the slow cooker. Cook until the dough is no longer raw in the center.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/806223.jpg"
     },
     {
          "title": "Downeast Maine Pumpkin Bread",
          "url": "https://www.allrecipes.com/recipe/6820/downeast-maine-pumpkin-bread/",
          "rating": "4.81",
          "numreviews": "7158",
          "ingredients": [
               "1 (15 ounce) can pumpkin puree",
               "4 eggs",
               "1 cup vegetable oil",
               "2/3 cup water",
               "3 cups white sugar",
               "3 1/2 cups all-purpose flour",
               "2 teaspoons baking soda",
               "1 1/2 teaspoons salt",
               "1 teaspoon ground cinnamon",
               "1 teaspoon ground nutmeg",
               "1/2 teaspoon ground cloves",
               "1/4 teaspoon ground ginger"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 7x3 inch loaf pans.\nIn a large bowl, mix together pumpkin puree, eggs, oil, water and sugar until well blended. In a separate bowl, whisk together the flour, baking soda, salt, cinnamon, nutmeg, cloves and ginger. Stir the dry ingredients into the pumpkin mixture until just blended. Pour into the prepared pans.\nBake for about 50 minutes in the preheated oven. Loaves are done when toothpick inserted in center comes out clean.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4567827.jpg"
     },
     {
          "title": "Mom's Zucchini Bread",
          "url": "https://www.allrecipes.com/recipe/6698/moms-zucchini-bread/",
          "rating": "4.76",
          "numreviews": "7184",
          "ingredients": [
               "3 cups all-purpose flour",
               "1 teaspoon salt",
               "1 teaspoon baking soda",
               "1 teaspoon baking powder",
               "1 tablespoon ground cinnamon",
               "3 eggs",
               "1 cup vegetable oil",
               "2 1/4 cups white sugar",
               "3 teaspoons vanilla extract",
               "2 cups grated zucchini",
               "1 cup chopped walnuts"
          ],
          "instructions": "Grease and flour two 8 x 4 inch pans.  Preheat oven to 325 degrees F (165 degrees C).\nSift flour, salt, baking powder, soda, and cinnamon together in a bowl.\nBeat eggs, oil, vanilla, and sugar together in a large bowl.  Add sifted ingredients to the creamed mixture, and beat well.  Stir in zucchini and nuts until well combined.  Pour batter into prepared pans.\nBake for 40 to 60 minutes, or until tester inserted in the center comes out clean.  Cool in pan on rack for 20 minutes.  Remove bread from pan, and completely cool.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/1037957.jpg"
     },
     {
          "title": "Brown Sugar Meatloaf",
          "url": "https://www.allrecipes.com/recipe/25203/brown-sugar-meatloaf/",
          "rating": "4.58",
          "numreviews": "6417",
          "ingredients": [
               "1/2 cup packed brown sugar",
               "1/2 cup ketchup",
               "1 1/2 pounds lean ground beef",
               "3/4 cup milk",
               "2 eggs",
               "1 1/2 teaspoons salt",
               "1/4 teaspoon ground black pepper",
               "1 small onion, chopped",
               "1/4 teaspoon ground ginger",
               "3/4 cup finely crushed saltine cracker crumbs"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 5x9 inch loaf pan.\nPress the brown sugar in the bottom of the prepared loaf pan and spread the ketchup over the sugar.\nIn a mixing bowl, mix thoroughly all remaining ingredients and shape into a loaf. Place on top of the ketchup.\nBake in preheated oven for 1 hour or until juices are clear.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/2573174.jpg"
     },
     {
          "title": "Baked Ziti I",
          "url": "https://www.allrecipes.com/recipe/11758/baked-ziti-i/",
          "rating": "4.70",
          "numreviews": "5794",
          "ingredients": [
               "1 pound dry ziti pasta",
               "1 onion, chopped",
               "1 pound lean ground beef",
               "2 (26 ounce) jars spaghetti sauce",
               "6 ounces provolone cheese, sliced",
               "1 1/2 cups sour cream",
               "6 ounces mozzarella cheese, shredded",
               "2 tablespoons grated Parmesan cheese"
          ],
          "instructions": "Bring a large pot of lightly salted water to a boil. Add ziti pasta, and cook until al dente, about 8 minutes; drain.\nIn a large skillet, brown onion and ground beef over medium heat. Add spaghetti sauce, and simmer 15 minutes.\nPreheat the oven to 350 degrees F (175 degrees C). Butter a 9x13 inch baking dish. Layer as follows: 1/2 of the ziti, Provolone cheese, sour cream, 1/2 sauce mixture, remaining ziti, mozzarella cheese and remaining sauce mixture. Top with grated Parmesan cheese.\nBake for 30 minutes in the preheated oven, or until cheeses are melted.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4557541.jpg"
     },
     {
          "title": "Janet's Rich Banana Bread",
          "url": "https://www.allrecipes.com/recipe/17066/janets-rich-banana-bread/",
          "rating": "4.82",
          "numreviews": "5834",
          "ingredients": [
               "1/2 cup butter, melted",
               "1 cup white sugar",
               "2 eggs",
               "1 teaspoon vanilla extract",
               "1 1/2 cups all-purpose flour",
               "1 teaspoon baking soda",
               "1/2 teaspoon salt",
               "1/2 cup sour cream",
               "1/2 cup chopped walnuts",
               "2 medium bananas, sliced"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5 inch loaf pan.\nIn a large bowl, stir together the melted butter and sugar. Add the eggs and vanilla, mix well. Combine the flour, baking soda and salt, stir into the butter mixture until smooth. Finally, fold in the sour cream, walnuts and bananas. Spread evenly into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 60 minutes, or until a toothpick inserted into the center of the loaf comes out clean. Cool loaf in the pan for 10 minutes before removing to a wire rack to cool completely.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/171761.jpg"
     },
     {
          "title": "Clone of a Cinnabon",
          "url": "https://www.allrecipes.com/recipe/20156/clone-of-a-cinnabon/",
          "rating": "4.82",
          "numreviews": "5711",
          "ingredients": [
               "1 cup warm milk (110 degrees F/45 degrees C)",
               "2 eggs, room temperature",
               "1/3 cup margarine, melted",
               "4 1/2 cups bread flour",
               "1 teaspoon salt",
               "1/2 cup white sugar",
               "2 1/2 teaspoons bread machine yeast",
               "1 cup brown sugar, packed",
               "2 1/2 tablespoons ground cinnamon",
               "1/3 cup butter, softened",
               "1 (3 ounce) package cream cheese, softened",
               "1/4 cup butter, softened",
               "1 1/2 cups confectioners' sugar",
               "1/2 teaspoon vanilla extract",
               "1/8 teaspoon salt"
          ],
          "instructions": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select dough cycle; press Start.\nAfter the dough has doubled in size turn it out onto a lightly floured surface, cover and let rest for 10 minutes. In a small bowl, combine brown sugar and cinnamon.\nRoll dough into a 16x21-inch rectangle. Spread dough with 1/3 cup butter and sprinkle evenly with sugar/cinnamon mixture. Roll up dough and cut into 12 rolls. Place rolls in a lightly greased 9x13 inch baking pan. Cover and let rise until nearly doubled, about 30 minutes. Meanwhile, preheat oven to 400 degrees F (200 degrees C).\nBake rolls in preheated oven until golden brown, about 15 minutes. While rolls are baking, beat together cream cheese, 1/4 cup butter, confectioners' sugar, vanilla extract and salt. Spread frosting on warm rolls before serving.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/36449.jpg"
     },
     {
          "title": "Baked Teriyaki Chicken",
          "url": "https://www.allrecipes.com/recipe/9023/baked-teriyaki-chicken/",
          "rating": "4.65",
          "numreviews": "5184",
          "ingredients": [
               "1 tablespoon cornstarch",
               "1 tablespoon cold water",
               "1/2 cup white sugar",
               "1/2 cup soy sauce",
               "1/4 cup cider vinegar",
               "1 clove garlic, minced",
               "1/2 teaspoon ground ginger",
               "1/4 teaspoon ground black pepper",
               "12 skinless chicken thighs"
          ],
          "instructions": "In a small saucepan over low heat, combine the cornstarch, cold water, sugar, soy sauce, vinegar, garlic, ginger and ground black pepper. Let simmer, stirring frequently, until sauce thickens and bubbles.\nPreheat oven to 425 degrees F (220 degrees C).\nPlace chicken pieces in a lightly greased 9x13 inch baking dish. Brush chicken with the sauce. Turn pieces over, and brush again.\nBake in the preheated oven for 30 minutes. Turn pieces over, and bake for another 30 minutes, until no longer pink and juices run clear. Brush with sauce every 10 minutes during cooking.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4530047.jpg"
     },
     {
          "title": "Boilermaker Tailgate Chili",
          "url": "https://www.allrecipes.com/recipe/78299/boilermaker-tailgate-chili/",
          "rating": "4.82",
          "numreviews": "5020",
          "ingredients": [
               "2 pounds ground beef chuck",
               "1 pound bulk Italian sausage",
               "3 (15 ounce) cans chili beans, drained",
               "1 (15 ounce) can chili beans in spicy sauce",
               "2 (28 ounce) cans diced tomatoes with juice",
               "1 (6 ounce) can tomato paste",
               "1 large yellow onion, chopped",
               "3 stalks celery, chopped",
               "1 green bell pepper, seeded and chopped",
               "1 red bell pepper, seeded and chopped",
               "2 green chile peppers, seeded and chopped",
               "1 tablespoon bacon bits",
               "4 cubes beef bouillon",
               "1/2 cup beer",
               "1/4 cup chili powder",
               "1 tablespoon Worcestershire sauce",
               "1 tablespoon minced garlic",
               "1 tablespoon dried oregano",
               "2 teaspoons ground cumin",
               "2 teaspoons hot pepper sauce (e.g. Tabasco(TM))",
               "1 teaspoon dried basil",
               "1 teaspoon salt",
               "1 teaspoon ground black pepper",
               "1 teaspoon cayenne pepper",
               "1 teaspoon paprika",
               "1 teaspoon white sugar",
               "1 (10.5 ounce) bag corn chips such as Fritos(R)",
               "1 (8 ounce) package shredded Cheddar cheese"
          ],
          "instructions": "Heat a large stock pot over medium-high heat. Crumble the ground chuck and sausage into the hot pan, and cook until evenly browned. Drain off excess grease.\nPour in the chili beans, spicy chili beans, diced tomatoes and tomato paste. Add the onion, celery, green and red bell peppers, chile peppers, bacon bits, bouillon, and beer. Season with chili powder, Worcestershire sauce, garlic, oregano, cumin, hot pepper sauce, basil, salt, pepper, cayenne, paprika, and sugar. Stir to blend, then cover and simmer over low heat for at least 2 hours, stirring occasionally.\nAfter 2 hours, taste, and adjust salt, pepper, and chili powder if necessary. The longer the chili simmers, the better it will taste. Remove from heat and serve, or refrigerate, and serve the next day.\nTo serve, ladle into bowls, and top with corn chips and shredded Cheddar cheese.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/890638.jpg"
     },
     {
          "title": "Too Much Chocolate Cake",
          "url": "https://www.allrecipes.com/recipe/7565/too-much-chocolate-cake/",
          "rating": "4.79",
          "numreviews": "5464",
          "ingredients": [
               "1 (18.25 ounce) package devil's food cake mix",
               "1 (5.9 ounce) package instant chocolate pudding mix",
               "1 cup sour cream",
               "1 cup vegetable oil",
               "4 eggs",
               "1/2 cup warm water",
               "2 cups semisweet chocolate chips"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, mix together the cake and pudding mixes, sour cream, oil, beaten eggs and water.  Stir in the chocolate chips and pour batter into a well greased 12 cup bundt pan.\nBake for 50 to 55 minutes, or until top is springy to the touch and a wooden toothpick inserted comes out clean. Cool cake thoroughly in pan at least an hour and a half before inverting onto a plate  If desired, dust the cake with powdered sugar.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/1130307.jpg"
     },
     {
          "title": "Apple Crisp II",
          "url": "https://www.allrecipes.com/recipe/12409/apple-crisp-ii/",
          "rating": "4.70",
          "numreviews": "5402",
          "ingredients": [
               "10 cups all-purpose apples, peeled, cored and sliced",
               "1 cup white sugar",
               "1 tablespoon all-purpose flour",
               "1 teaspoon ground cinnamon",
               "1/2 cup water",
               "1 cup quick-cooking oats",
               "1 cup all-purpose flour",
               "1 cup packed brown sugar",
               "1/4 teaspoon baking powder",
               "1/4 teaspoon baking soda",
               "1/2 cup butter, melted"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degree C).\nPlace the sliced apples in a 9x13 inch pan. Mix the white sugar, 1 tablespoon flour and ground cinnamon together, and sprinkle over apples. Pour water evenly over all.\nCombine the oats, 1 cup flour, brown sugar, baking powder, baking soda and melted butter together. Crumble evenly over the apple mixture.\nBake at 350 degrees F (175 degrees C) for about 45 minutes.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/277929.jpg"
     },
     {
          "title": "Slow Cooker Chicken Taco Soup",
          "url": "https://www.allrecipes.com/recipe/70343/slow-cooker-chicken-taco-soup/",
          "rating": "4.68",
          "numreviews": "5185",
          "ingredients": [
               "1 onion, chopped",
               "1 (16 ounce) can chili beans",
               "1 (15 ounce) can black beans",
               "1 (15 ounce) can whole kernel corn, drained",
               "1 (8 ounce) can tomato sauce",
               "1 (12 fluid ounce) can or bottle beer",
               "2 (10 ounce) cans diced tomatoes with green chilies, undrained",
               "1 (1.25 ounce) package taco seasoning",
               "3 whole skinless, boneless chicken breasts",
               "1 (8 ounce) package shredded Cheddar cheese (optional)",
               "sour cream (optional)",
               "crushed tortilla chips (optional)"
          ],
          "instructions": "Place the onion, chili beans, black beans, corn, tomato sauce, beer, and diced tomatoes in a slow cooker. Add taco seasoning, and stir to blend. Lay chicken breasts on top of the mixture, pressing down slightly until just covered by the other ingredients. Set slow cooker for low heat, cover, and cook for 5 hours.\nRemove chicken breasts from the soup, and allow to cool long enough to be handled. Stir the shredded chicken back into the soup, and continue cooking for 2 hours. Serve topped with shredded Cheddar cheese, a dollop of sour cream, and crushed tortilla chips, if desired.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/3706561.jpg"
     },
     {
          "title": "Easy Meatloaf",
          "url": "https://www.allrecipes.com/recipe/16354/easy-meatloaf/",
          "rating": "4.57",
          "numreviews": "5344",
          "ingredients": [
               "1 1/2 pounds ground beef",
               "1 egg",
               "1 onion, chopped",
               "1 cup milk",
               "1 cup dried bread crumbs",
               "salt and pepper to taste",
               "2 tablespoons brown sugar",
               "2 tablespoons prepared mustard",
               "1/3 cup ketchup"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine the beef, egg, onion, milk and bread OR cracker crumbs. Season with salt and pepper to taste and place in a lightly greased 5x9 inch loaf pan, OR form into a loaf and place in a lightly greased 9x13 inch baking dish.\nIn a separate small bowl, combine the brown sugar, mustard and ketchup. Mix well and pour over the meatloaf.\nBake at 350 degrees F (175 degrees C) for 1 hour.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/682282.jpg"
     },
     {
          "title": "Sloppy Joes II",
          "url": "https://www.allrecipes.com/recipe/24264/sloppy-joes-ii/",
          "rating": "4.66",
          "numreviews": "5116",
          "ingredients": [
               "1 pound lean ground beef",
               "1/4 cup chopped onion",
               "1/4 cup chopped green bell pepper",
               "1/2 teaspoon garlic powder",
               "1 teaspoon prepared yellow mustard",
               "3/4 cup ketchup",
               "3 teaspoons brown sugar",
               "salt to taste",
               "ground black pepper to taste"
          ],
          "instructions": "In a medium skillet over medium heat, brown the ground beef, onion, and green pepper; drain off liquids.\nStir in the garlic powder, mustard, ketchup, and brown sugar; mix thoroughly. Reduce heat, and simmer for 30 minutes. Season with salt and pepper.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/747244.jpg"
     },
     {
          "title": "Taco Seasoning I",
          "url": "https://www.allrecipes.com/recipe/46653/taco-seasoning-i/",
          "rating": "4.82",
          "numreviews": "4752",
          "ingredients": [
               "1 tablespoon chili powder",
               "1/4 teaspoon garlic powder",
               "1/4 teaspoon onion powder",
               "1/4 teaspoon crushed red pepper flakes",
               "1/4 teaspoon dried oregano",
               "1/2 teaspoon paprika",
               "1 1/2 teaspoons ground cumin",
               "1 teaspoon sea salt",
               "1 teaspoon black pepper"
          ],
          "instructions": "In a small bowl, mix together chili powder, garlic powder, onion powder, red pepper flakes, oregano, paprika, cumin, salt and pepper. Store in an airtight container.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4538211.jpg"
     },
     {
          "title": "Chantal's New York Cheesecake",
          "url": "https://www.allrecipes.com/recipe/8350/chantals-new-york-cheesecake/",
          "rating": "4.71",
          "numreviews": "5453",
          "ingredients": [
               "15 graham crackers, crushed",
               "2 tablespoons butter, melted",
               "4 (8 ounce) packages cream cheese",
               "1 1/2 cups white sugar",
               "3/4 cup milk",
               "4 eggs",
               "1 cup sour cream",
               "1 tablespoon vanilla extract",
               "1/4 cup all-purpose flour"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9 inch springform pan.\nIn a medium bowl, mix graham cracker crumbs with melted butter. Press onto bottom of springform pan.\nIn a large bowl, mix cream cheese with sugar until smooth. Blend in milk, and then mix in the eggs one at a time, mixing just enough to incorporate. Mix in sour cream, vanilla and flour until smooth. Pour filling into prepared crust.\nBake in preheated oven for 1 hour. Turn the oven off, and let cake cool in oven with the door closed for 5 to 6 hours; this prevents cracking. Chill in refrigerator until serving.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/5185165.jpg"
     },
     {
          "title": "Guacamole",
          "url": "https://www.allrecipes.com/recipe/14231/guacamole/",
          "rating": "4.81",
          "numreviews": "4517",
          "ingredients": [
               "3 avocados - peeled, pitted, and mashed",
               "1 lime, juiced",
               "1 teaspoon salt",
               "1/2 cup diced onion",
               "3 tablespoons chopped fresh cilantro",
               "2 roma (plum) tomatoes, diced",
               "1 teaspoon minced garlic",
               "1 pinch ground cayenne pepper (optional)"
          ],
          "instructions": "In a medium bowl, mash together the avocados, lime juice, and salt. Mix in onion, cilantro, tomatoes, and garlic. Stir in cayenne pepper. Refrigerate 1 hour for best flavor, or serve immediately.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4521556.jpg"
     },
     {
          "title": "Easy Sugar Cookies",
          "url": "https://www.allrecipes.com/recipe/9870/easy-sugar-cookies/",
          "rating": "4.47",
          "numreviews": "5655",
          "ingredients": [
               "2 3/4 cups all-purpose flour",
               "1 teaspoon baking soda",
               "1/2 teaspoon baking powder",
               "1 cup butter, softened",
               "1 1/2 cups white sugar",
               "1 egg",
               "1 teaspoon vanilla extract"
          ],
          "instructions": "Preheat oven to 375 degrees F (190 degrees C). In a small bowl, stir together flour, baking soda, and baking powder. Set aside.\nIn a large bowl, cream together the butter and sugar until smooth. Beat in egg and vanilla. Gradually blend in the dry ingredients. Roll rounded teaspoonfuls of dough into balls, and place onto ungreased cookie sheets.\nBake 8 to 10 minutes in the preheated oven, or until golden. Let stand on cookie sheet two minutes before removing to cool on wire racks.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4478596.jpg"
     },
     {
          "title": "Grandmother's Buttermilk Cornbread",
          "url": "https://www.allrecipes.com/recipe/76594/grandmothers-buttermilk-cornbread/",
          "rating": "4.81",
          "numreviews": "5191",
          "ingredients": [
               "1/2 cup butter",
               "2/3 cup white sugar",
               "2 eggs",
               "1 cup buttermilk",
               "1/2 teaspoon baking soda",
               "1 cup cornmeal",
               "1 cup all-purpose flour",
               "1/2 teaspoon salt"
          ],
          "instructions": "Preheat oven to 375 degrees F (175 degrees C). Grease an 8 inch square pan.\nMelt butter in large skillet. Remove from heat and stir in sugar. Quickly add eggs and beat until well blended. Combine buttermilk with baking soda and stir into mixture in pan. Stir in cornmeal, flour, and salt until well blended and few lumps remain. Pour batter into the prepared pan.\nBake in the preheated oven for 30 to 40 minutes, or until a toothpick inserted in the center comes out clean.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/2077366.jpg"
     },
     {
          "title": "Carrot Cake III",
          "url": "https://www.allrecipes.com/recipe/7402/carrot-cake-iii/",
          "rating": "4.71",
          "numreviews": "5188",
          "ingredients": [
               "4 eggs",
               "1 1/4 cups vegetable oil",
               "2 cups white sugar",
               "2 teaspoons vanilla extract",
               "2 cups all-purpose flour",
               "2 teaspoons baking soda",
               "2 teaspoons baking powder",
               "1/2 teaspoon salt",
               "2 teaspoons ground cinnamon",
               "3 cups grated carrots",
               "1 cup chopped pecans",
               "1/2 cup butter, softened",
               "8 ounces cream cheese, softened",
               "4 cups confectioners' sugar",
               "1 teaspoon vanilla extract",
               "1 cup chopped pecans"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C).  Grease and flour a 9x13 inch pan.\nIn a large bowl, beat together eggs, oil, white sugar and 2 teaspoons vanilla. Mix in flour, baking soda, baking powder, salt and cinnamon. Stir in carrots. Fold in pecans.  Pour into prepared pan.\nBake in the preheated oven for 40 to 50 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\nTo Make Frosting:  In a medium bowl, combine butter, cream cheese, confectioners' sugar and 1 teaspoon vanilla. Beat until the mixture is smooth and creamy. Stir in chopped pecans. Frost the cooled cake.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/1053595.jpg"
     },
     {
          "title": "Chicken Cordon Bleu II",
          "url": "https://www.allrecipes.com/recipe/8669/chicken-cordon-bleu-ii/",
          "rating": "4.78",
          "numreviews": "4642",
          "ingredients": [
               "6 skinless, boneless chicken breast halves",
               "6 slices Swiss cheese",
               "6 slices ham",
               "3 tablespoons all-purpose flour",
               "1 teaspoon paprika",
               "6 tablespoons butter",
               "1/2 cup dry white wine",
               "1 teaspoon chicken bouillon granules",
               "1 tablespoon cornstarch",
               "1 cup heavy whipping cream"
          ],
          "instructions": "Pound chicken breasts if they are too thick. Place a cheese and ham slice on each breast within 1/2 inch of the edges. Fold the edges of the chicken over the filling, and secure with toothpicks. Mix the flour and paprika in a small bowl, and coat the chicken pieces.\nHeat the butter in a large skillet over medium-high heat, and cook the chicken until browned on all sides. Add the wine and bouillon. Reduce heat to low, cover, and simmer for 30 minutes, until chicken is no longer pink and juices run clear.\nRemove the toothpicks, and transfer the breasts to a warm platter. Blend the cornstarch with the cream in a small bowl, and whisk slowly into the skillet. Cook, stirring until thickened, and pour over the chicken. Serve warm.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4535588.jpg"
     },
     {
          "title": "Mrs. Sigg's Snickerdoodles",
          "url": "https://www.allrecipes.com/recipe/10687/mrs-siggs-snickerdoodles/",
          "rating": "4.74",
          "numreviews": "4670",
          "ingredients": [
               "1/2 cup butter, softened",
               "1/2 cup shortening",
               "1 1/2 cups white sugar",
               "2 eggs",
               "2 teaspoons vanilla extract",
               "2 3/4 cups all-purpose flour",
               "2 teaspoons cream of tartar",
               "1 teaspoon baking soda",
               "1/4 teaspoon salt",
               "2 tablespoons white sugar",
               "2 teaspoons ground cinnamon"
          ],
          "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nCream together butter, shortening, 1 1/2 cups sugar, the eggs and the vanilla. Blend in the flour, cream of tartar, soda and salt. Shape dough by rounded spoonfuls into balls.\nMix the 2 tablespoons sugar and the cinnamon. Roll balls of dough in mixture. Place 2 inches apart on ungreased baking sheets.\nBake 8 to 10 minutes, or until set but not too hard. Remove immediately from baking sheets.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/3206419.jpg"
     },
     {
          "title": "Big Soft Ginger Cookies",
          "url": "https://www.allrecipes.com/recipe/17165/big-soft-ginger-cookies/",
          "rating": "4.74",
          "numreviews": "4745",
          "ingredients": [
               "2 1/4 cups all-purpose flour",
               "2 teaspoons ground ginger",
               "1 teaspoon baking soda",
               "3/4 teaspoon ground cinnamon",
               "1/2 teaspoon ground cloves",
               "1/4 teaspoon salt",
               "3/4 cup margarine, softened",
               "1 cup white sugar",
               "1 egg",
               "1 tablespoon water",
               "1/4 cup molasses",
               "2 tablespoons white sugar"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Sift together the flour, ginger, baking soda, cinnamon, cloves, and salt. Set aside.\nIn a large bowl, cream together the margarine and 1 cup sugar until light and fluffy. Beat in the egg, then stir in the water and molasses. Gradually stir the sifted ingredients into the molasses mixture. Shape dough into walnut sized balls, and roll them in the remaining 2 tablespoons of sugar. Place the cookies 2 inches apart onto an ungreased cookie sheet, and flatten slightly.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely. Store in an airtight container.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4574068.jpg"
     },
     {
          "title": "Zesty Slow Cooker Chicken Barbecue",
          "url": "https://www.allrecipes.com/recipe/65896/zesty-slow-cooker-chicken-barbecue/",
          "rating": "4.58",
          "numreviews": "4265",
          "ingredients": [
               "6 frozen skinless, boneless chicken breast halves",
               "1 (12 ounce) bottle barbeque sauce",
               "1/2 cup Italian salad dressing",
               "1/4 cup brown sugar",
               "2 tablespoons Worcestershire sauce"
          ],
          "instructions": "Place chicken in a slow cooker. In a bowl, mix the barbecue sauce, Italian salad dressing, brown sugar, and Worcestershire sauce. Pour over the chicken.\nCover, and cook 3 to 4 hours on High or 6 to 8 hours on Low.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/879977.jpg"
     },
     {
          "title": "Baked Pork Chops I",
          "url": "https://www.allrecipes.com/recipe/16348/baked-pork-chops-i/",
          "rating": "4.55",
          "numreviews": "4499",
          "ingredients": [
               "6 pork chops",
               "1 teaspoon garlic powder",
               "1 teaspoon seasoning salt",
               "2 egg, beaten",
               "1/4 cup all-purpose flour",
               "2 cups Italian-style seasoned bread crumbs",
               "4 tablespoons olive oil",
               "1 (10.75 ounce) can condensed cream of mushroom soup",
               "1/2 cup milk",
               "1/3 cup white wine"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nRinse pork chops, pat dry, and season with garlic powder and seasoning salt to taste. Place the beaten eggs in a small bowl. Dredge the pork chops lightly in flour, dip in the egg, and coat liberally with bread crumbs.\nHeat the oil in a medium skillet over medium-high heat. Fry the pork chops 5 minutes per side, or until the breading appears well browned. Transfer the chops to a 9x13 inch baking dish, and cover with foil.\nBake in the preheated oven for 1 hour. While baking, combine the cream of mushroom soup, milk and white wine in a medium bowl. After the pork chops have baked for an hour, cover them with the soup mixture. Replace foil, and bake for another 30 minutes.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/642155.jpg"
     },
     {
          "title": "Garlic Chicken",
          "url": "https://www.allrecipes.com/recipe/8652/garlic-chicken/",
          "rating": "4.57",
          "numreviews": "4147",
          "ingredients": [
               "1/4 cup olive oil",
               "2 cloves garlic, crushed",
               "1/4 cup Italian-seasoned bread crumbs",
               "1/4 cup grated Parmesan cheese",
               "4 skinless, boneless chicken breast halves"
          ],
          "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nHeat olive oil and garlic in a small saucepan over low heat until warmed, 1 to 2 minutes. Transfer garlic and oil to a shallow bowl.\nCombine bread crumbs and Parmesan cheese in a separate shallow bowl.\nDip chicken breasts in the olive oil-garlic mixture using tongs; transfer to bread crumb mixture and turn to evenly coat. Transfer coated chicken to a shallow baking dish.\nBake in the preheated oven until no longer pink and juices run clear, 30 to 35 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4562452.jpg"
     },
     {
          "title": "Quinoa and Black Beans",
          "url": "https://www.allrecipes.com/recipe/49552/quinoa-and-black-beans/",
          "rating": "4.64",
          "numreviews": "3972",
          "ingredients": [
               "1 teaspoon vegetable oil",
               "1 onion, chopped",
               "3 cloves garlic, chopped",
               "3/4 cup quinoa",
               "1 1/2 cups vegetable broth",
               "1 teaspoon ground cumin",
               "1/4 teaspoon cayenne pepper",
               "salt and ground black pepper to taste",
               "1 cup frozen corn kernels",
               "2 (15 ounce) cans black beans, rinsed and drained",
               "1/2 cup chopped fresh cilantro"
          ],
          "instructions": "Heat oil in a saucepan over medium heat; cook and stir onion and garlic until lightly browned, about 10 minutes.\nMix quinoa into onion mixture and cover with vegetable broth; season with cumin, cayenne pepper, salt, and pepper. Bring the mixture to a boil. Cover, reduce heat, and simmer until quinoa is tender and broth is absorbed, about 20 minutes.\nStir frozen corn into the saucepan, and continue to simmer until heated through, about 5 minutes; mix in the black beans and cilantro.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/357989.jpg"
     },
     {
          "title": "Amish White Bread",
          "url": "https://www.allrecipes.com/recipe/6788/amish-white-bread/",
          "rating": "4.79",
          "numreviews": "4538",
          "ingredients": [
               "2 cups warm water (110 degrees F/45 degrees C)",
               "2/3 cup white sugar",
               "1 1/2 tablespoons active dry yeast",
               "1 1/2 teaspoons salt",
               "1/4 cup vegetable oil",
               "6 cups bread flour"
          ],
          "instructions": "In a large bowl, dissolve the sugar in warm water, and then stir in yeast. Allow to proof until yeast resembles a creamy foam.\nMix salt and oil into the yeast. Mix in flour one cup at a time. Knead dough on a lightly floured surface until smooth. Place in a well oiled bowl, and turn dough to coat. Cover with a damp cloth. Allow to rise until doubled in bulk, about 1 hour.\nPunch dough down. Knead for a few minutes, and divide in half. Shape into loaves, and place into two well oiled 9x5 inch loaf pans. Allow to rise for 30 minutes, or until dough has risen 1 inch above pans.\nBake at 350 degrees F (175 degrees C) for 30 minutes.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/731540.jpg"
     },
     {
          "title": "Banana Sour Cream Bread",
          "url": "https://www.allrecipes.com/recipe/6984/banana-sour-cream-bread/",
          "rating": "4.77",
          "numreviews": "4266",
          "ingredients": [
               "1/4 cup white sugar",
               "1 teaspoon ground cinnamon",
               "3/4 cup butter",
               "3 cups white sugar",
               "3 eggs",
               "6 very ripe bananas, mashed",
               "1 (16 ounce) container sour cream",
               "2 teaspoons vanilla extract",
               "2 teaspoons ground cinnamon",
               "1/2 teaspoon salt",
               "3 teaspoons baking soda",
               "4 1/2 cups all-purpose flour",
               "1 cup chopped walnuts (optional)"
          ],
          "instructions": "Preheat oven to 300 degrees F (150 degrees C). Grease four 7x3 inch loaf pans. In a small bowl, stir together 1/4 cup white sugar and 1 teaspoon cinnamon. Dust pans lightly with cinnamon and sugar mixture.\nIn a large bowl, cream butter and 3 cups sugar. Mix in eggs, mashed bananas, sour cream, vanilla and cinnamon. Mix in salt, baking soda and flour. Stir in nuts.  Divide into prepared pans.\nBake for 1 hour, until a toothpick inserted in center comes out clean.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4510541.jpg"
     },
     {
          "title": "Chicken Marsala",
          "url": "https://www.allrecipes.com/recipe/8887/chicken-marsala/",
          "rating": "4.54",
          "numreviews": "3788",
          "ingredients": [
               "1/4 cup all-purpose flour for coating",
               "1/2 teaspoon salt",
               "1/4 teaspoon ground black pepper",
               "1/2 teaspoon dried oregano",
               "4 skinless, boneless chicken breast halves - pounded 1/4 inch thick",
               "4 tablespoons butter",
               "4 tablespoons olive oil",
               "1 cup sliced mushrooms",
               "1/2 cup Marsala wine",
               "1/4 cup cooking sherry"
          ],
          "instructions": "In a shallow dish or bowl, mix together the flour, salt, pepper and oregano. Coat chicken pieces in flour mixture.\nIn a large skillet, melt butter in oil over medium heat. Place chicken in the pan, and lightly brown.  Turn over chicken pieces, and add mushrooms. Pour in wine and sherry.  Cover skillet; simmer chicken 10 minutes, turning once, until no longer pink and juices run clear.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/5107151.jpg"
     },
     {
          "title": "Slow-Cooker Chicken Tortilla Soup",
          "url": "https://www.allrecipes.com/recipe/89539/slow-cooker-chicken-tortilla-soup/",
          "rating": "4.68",
          "numreviews": "3890",
          "ingredients": [
               "1 pound shredded, cooked chicken",
               "1 (15 ounce) can whole peeled tomatoes, mashed",
               "1 (10 ounce) can enchilada sauce",
               "1 medium onion, chopped",
               "1 (4 ounce) can chopped green chile peppers",
               "2 cloves garlic, minced",
               "2 cups water",
               "1 (14.5 ounce) can chicken broth",
               "1 teaspoon cumin",
               "1 teaspoon chili powder",
               "1 teaspoon salt",
               "1/4 teaspoon black pepper",
               "1 bay leaf",
               "1 (10 ounce) package frozen corn",
               "1 tablespoon chopped cilantro",
               "7 corn tortillas",
               "vegetable oil"
          ],
          "instructions": "Place chicken, tomatoes, enchilada sauce, onion, green chiles, and garlic into a slow cooker. Pour in water and chicken broth, and season with cumin, chili powder, salt, pepper, and bay leaf. Stir in corn and cilantro. Cover, and cook on Low setting for 6 to 8 hours or on High setting for 3 to 4 hours.\nPreheat oven to 400 degrees F (200 degrees C).\nLightly brush both sides of tortillas with oil. Cut tortillas into strips, then spread on a baking sheet.\nBake in preheated oven until crisp, about 10 to 15 minutes. To serve, sprinkle tortilla strips over soup.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/193211.jpg"
     },
     {
          "title": "Creamy Rice Pudding",
          "url": "https://www.allrecipes.com/recipe/24059/creamy-rice-pudding/",
          "rating": "4.73",
          "numreviews": "4330",
          "ingredients": [
               "3/4 cup uncooked white rice",
               "2 cups milk, divided",
               "1/3 cup white sugar",
               "1/4 teaspoon salt",
               "1 egg, beaten",
               "2/3 cup golden raisins",
               "1 tablespoon butter",
               "1/2 teaspoon vanilla extract"
          ],
          "instructions": "Bring 1 1/2  cups water to a boil in a saucepan; stir rice into boiling water. Reduce heat to low, cover, and simmer for 20 minutes.\nIn a clean saucepan, combine 1 1/2 cups cooked rice, 1 1/2 cups milk, sugar and salt. Cook over medium heat until thick and creamy, 15 to 20 minutes. Stir in remaining 1/2 cup milk, beaten egg, and raisins; cook 2 minutes more, stirring constantly. Remove from heat and stir in butter and vanilla.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/3381043.jpg"
     },
     {
          "title": "Creamy Au Gratin Potatoes",
          "url": "https://www.allrecipes.com/recipe/15925/creamy-au-gratin-potatoes/",
          "rating": "4.53",
          "numreviews": "3969",
          "ingredients": [
               "4 russet potatoes, sliced into 1/4 inch slices",
               "1 onion, sliced into rings",
               "salt and pepper to taste",
               "3 tablespoons butter",
               "3 tablespoons all-purpose flour",
               "1/2 teaspoon salt",
               "2 cups milk",
               "1 1/2 cups shredded Cheddar cheese"
          ],
          "instructions": "Preheat oven to 400 degrees F (200 degrees C). Butter a 1 quart casserole dish.\nLayer 1/2 of the potatoes into bottom of the prepared casserole dish. Top with the onion slices, and add the remaining potatoes. Season with salt and pepper to taste.\nIn a medium-size saucepan, melt butter over medium heat. Mix in the flour and salt, and stir constantly with a whisk for one minute. Stir in milk. Cook until mixture has thickened. Stir in cheese all at once, and continue stirring until melted, about 30 to 60 seconds. Pour cheese over the potatoes, and cover the dish with aluminum foil.\nBake 1 1/2 hours in the preheated oven.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/738814.jpg"
     },
     {
          "title": "Quick and Easy Alfredo Sauce",
          "url": "https://www.allrecipes.com/recipe/19402/quick-and-easy-alfredo-sauce/",
          "rating": "4.61",
          "numreviews": "4109",
          "ingredients": [
               "1/2 cup butter",
               "1 (8 ounce) package cream cheese",
               "2 teaspoons garlic powder",
               "2 cups milk",
               "6 ounces grated Parmesan cheese",
               "1/8 teaspoon ground black pepper"
          ],
          "instructions": "Melt butter in a medium, non-stick saucepan over medium heat.  Add cream cheese and garlic powder, stirring with wire whisk until smooth.  Add milk, a little at a time, whisking to smooth out lumps.  Stir in Parmesan and pepper.  Remove from heat when sauce reaches desired consistency.  Sauce will thicken rapidly, thin with milk if cooked too long.  Toss with hot pasta to serve.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/5149928.jpg"
     },
     {
          "title": "Maple Salmon",
          "url": "https://www.allrecipes.com/recipe/51283/maple-salmon/",
          "rating": "4.67",
          "numreviews": "3459",
          "ingredients": [
               "1/4 cup maple syrup",
               "2 tablespoons soy sauce",
               "1 clove garlic, minced",
               "1/4 teaspoon garlic salt",
               "1/8 teaspoon ground black pepper",
               "1 pound salmon"
          ],
          "instructions": "In a small bowl, mix the maple syrup, soy sauce, garlic, garlic salt, and pepper.\nPlace salmon in a shallow glass baking dish, and coat with the maple syrup mixture. Cover the dish, and marinate salmon in the refrigerator 30 minutes, turning once.\nPreheat oven to 400 degrees F (200 degrees C).\nPlace the baking dish in the preheated oven, and bake salmon uncovered 20 minutes, or until easily flaked with a fork.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/862371.jpg"
     },
     {
          "title": "Grilled Salmon I",
          "url": "https://www.allrecipes.com/recipe/12720/grilled-salmon-i/",
          "rating": "4.76",
          "numreviews": "3511",
          "ingredients": [
               "1 1/2 pounds salmon fillets",
               "lemon pepper to taste",
               "garlic powder to taste",
               "salt to taste",
               "1/3 cup soy sauce",
               "1/3 cup brown sugar",
               "1/3 cup water",
               "1/4 cup vegetable oil"
          ],
          "instructions": "Season salmon fillets with lemon pepper, garlic powder, and salt.\nIn a small bowl, stir together soy sauce, brown sugar, water, and vegetable oil until sugar is dissolved. Place fish in a large resealable plastic bag with the soy sauce mixture, seal, and turn to coat. Refrigerate for at least 2 hours.\nPreheat grill for medium heat.\nLightly oil grill grate. Place salmon on the preheated grill, and discard marinade. Cook salmon for 6 to 8 minutes per side, or until the fish flakes easily with a fork.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/800839.jpg"
     },
     {
          "title": "Beth's Spicy Oatmeal Raisin Cookies",
          "url": "https://www.allrecipes.com/recipe/10497/beths-spicy-oatmeal-raisin-cookies/",
          "rating": "4.75",
          "numreviews": "3845",
          "ingredients": [
               "1/2 cup butter, softened",
               "1/2 cup butter flavored shortening",
               "1 cup packed light brown sugar",
               "1/2 cup white sugar",
               "2 eggs",
               "1 teaspoon vanilla extract",
               "1 1/2 cups all-purpose flour",
               "1 teaspoon baking soda",
               "1 teaspoon ground cinnamon",
               "1/2 teaspoon ground cloves",
               "1/2 teaspoon salt",
               "3 cups rolled oats",
               "1 cup raisins"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, cream together the butter, butter flavored shortening, brown sugar, white sugar, eggs, and vanilla until smooth. Combine the flour, baking soda, cinnamon, cloves, and salt; stir into the sugar mixture. Stir in the oats and raisins. Drop by rounded teaspoonfuls onto ungreased cookie sheets.\nBake 10 to 12 minutes until light and golden. Do not overbake. Let them cool for 2 minutes before removing from cookie sheets to cool completely. Store in airtight container. Make sure you get some, because they don't last long!",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/1116153.jpg"
     },
     {
          "title": "Chewy Chocolate Chip Oatmeal Cookies",
          "url": "https://www.allrecipes.com/recipe/24445/chewy-chocolate-chip-oatmeal-cookies/",
          "rating": "4.55",
          "numreviews": "3946",
          "ingredients": [
               "1 cup butter, softened",
               "1 cup packed light brown sugar",
               "1/2 cup white sugar",
               "2 eggs",
               "2 teaspoons vanilla extract",
               "1 1/4 cups all-purpose flour",
               "1/2 teaspoon baking soda",
               "1 teaspoon salt",
               "3 cups quick-cooking oats",
               "1 cup chopped walnuts",
               "1 cup semisweet chocolate chips"
          ],
          "instructions": "Preheat the oven to 325 degrees F (165 degrees C).\nIn a large bowl, cream together the butter, brown sugar, and white sugar until smooth. Beat in eggs one at a time, then stir in vanilla. Combine the flour, baking soda, and salt; stir into the creamed mixture until just blended. Mix in the quick oats, walnuts, and chocolate chips. Drop by heaping spoonfuls onto ungreased baking sheets.\nBake for 12 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/493502.jpg"
     },
     {
          "title": "Slow Cooker Pulled Pork",
          "url": "https://www.allrecipes.com/recipe/141678/slow-cooker-pulled-pork/",
          "rating": "4.61",
          "numreviews": "3514",
          "ingredients": [
               "1 (2 pound) pork tenderloin",
               "1 (12 fluid ounce) can or bottle root beer",
               "1 (18 ounce) bottle your favorite barbecue sauce",
               "8 hamburger buns, split and lightly toasted"
          ],
          "instructions": "Place the pork tenderloin in a slow cooker; pour the root beer over the meat. Cover and cook on low until well cooked and the pork shreds easily, 6 to 7 hours. Note: the actual length of time may vary according to individual slow cooker. Drain well. Stir in barbecue sauce. Serve over hamburger buns.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/586964.jpg"
     },
     {
          "title": "Slow Cooker Beef Stew I",
          "url": "https://www.allrecipes.com/recipe/14685/slow-cooker-beef-stew-i/",
          "rating": "4.43",
          "numreviews": "3507",
          "ingredients": [
               "2 pounds beef stew meat, cut into 1-inch pieces",
               "1/4 cup all-purpose flour",
               "1/2 teaspoon salt",
               "1/2 teaspoon ground black pepper",
               "1 clove garlic, minced",
               "1 bay leaf",
               "1 teaspoon paprika",
               "1 teaspoon Worcestershire sauce",
               "1 onion, chopped",
               "1 1/2 cups beef broth",
               "3 potatoes, diced",
               "4 carrots, sliced",
               "1 stalk celery, chopped"
          ],
          "instructions": "Place meat in slow cooker. In a small bowl mix together the flour, salt, and pepper; pour over meat, and stir to coat meat with flour mixture. Stir in the garlic, bay leaf, paprika, Worcestershire sauce, onion, beef broth, potatoes, carrots, and celery.\nCover, and cook on Low setting for 10 to 12 hours, or on High setting for 4 to 6 hours.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4086.jpg"
     },
     {
          "title": "Cream Cheese Frosting II",
          "url": "https://www.allrecipes.com/recipe/9926/cream-cheese-frosting-ii/",
          "rating": "4.71",
          "numreviews": "3690",
          "ingredients": [
               "2 (8 ounce) packages cream cheese, softened",
               "1/2 cup butter, softened",
               "2 cups sifted confectioners' sugar",
               "1 teaspoon vanilla extract"
          ],
          "instructions": "In a medium bowl, cream together the cream cheese and butter until creamy. Mix in the vanilla, then gradually stir in the confectioners' sugar. Store in the refrigerator after use.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/2164995.jpg"
     },
     {
          "title": "Buffalo Chicken Dip",
          "url": "https://www.allrecipes.com/recipe/68461/buffalo-chicken-dip/",
          "rating": "4.71",
          "numreviews": "3525",
          "ingredients": [
               "2 (10 ounce) cans chunk chicken, drained",
               "2 (8 ounce) packages cream cheese, softened",
               "1 cup Ranch dressing",
               "3/4 cup pepper sauce (such as Frank's Red Hot(R))",
               "1 1/2 cups shredded Cheddar cheese",
               "1 bunch celery, cleaned and cut into 4 inch pieces",
               "1 (8 ounce) box chicken-flavored crackers"
          ],
          "instructions": "Heat chicken and hot sauce in a skillet over medium heat, until heated through. Stir in cream cheese and ranch dressing. Cook, stirring until well blended and warm. Mix in half of the shredded cheese, and transfer the mixture to a slow cooker. Sprinkle the remaining cheese over the top, cover, and cook on Low setting until hot and bubbly. Serve with celery sticks and crackers.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/3095600.jpg"
     },
     {
          "title": "Brooke's Best Bombshell Brownies",
          "url": "https://www.allrecipes.com/recipe/143667/brookes-best-bombshell-brownies/",
          "rating": "4.62",
          "numreviews": "3598",
          "ingredients": [
               "1 cup butter, melted",
               "3 cups white sugar",
               "1 tablespoon vanilla extract",
               "4 eggs",
               "1 1/2 cups all-purpose flour",
               "1 cup unsweetened cocoa powder",
               "1 teaspoon salt",
               "1 cup semisweet chocolate chips"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 baking dish.\nCombine the melted butter, sugar, and vanilla in a large bowl. Beat in the eggs, one at a time, mixing well after each, until thoroughly blended.\nSift the flour, cocoa powder, and salt in a bowl. Gradually stir flour mixture into the egg mixture until blended. Stir in the chocolate morsels. Spread the batter evenly into the prepared baking dish.\nBake in preheated oven until an inserted toothpick comes out clean, 35 to 40 minutes. Remove, and cool pan on wire rack before cutting.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/358859.jpg"
     },
     {
          "title": "Salsa Chicken",
          "url": "https://www.allrecipes.com/recipe/16700/salsa-chicken/",
          "rating": "4.63",
          "numreviews": "3196",
          "ingredients": [
               "4 skinless, boneless chicken breast halves",
               "4 teaspoons taco seasoning mix",
               "1 cup salsa",
               "1 cup shredded Cheddar cheese",
               "2 tablespoons sour cream (optional)"
          ],
          "instructions": "Preheat oven to 375  degrees F (190 degrees C)\nPlace chicken breasts in a lightly greased 9x13 inch baking dish. Sprinkle taco seasoning on both sides of chicken breasts, and pour salsa over all.\nBake at 375 degrees F (190 degrees C) for 25 to 35 minutes, or until chicken is tender and juicy and its juices run clear.\nSprinkle chicken evenly with cheese, and continue baking for an additional 3 to 5 minutes, or until cheese is melted and bubbly. Top with sour cream if desired, and serve.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4487510.jpg"
     },
     {
          "title": "Braised Balsamic Chicken",
          "url": "https://www.allrecipes.com/recipe/8665/braised-balsamic-chicken/",
          "rating": "4.38",
          "numreviews": "3001",
          "ingredients": [
               "6 skinless, boneless chicken breast halves",
               "1 teaspoon garlic salt",
               "ground black pepper to taste",
               "2 tablespoons olive oil",
               "1 onion, thinly sliced",
               "1 (14.5 ounce) can diced tomatoes",
               "1/2 cup balsamic vinegar",
               "1 teaspoon dried basil",
               "1 teaspoon dried oregano",
               "1 teaspoon dried rosemary",
               "1/2 teaspoon dried thyme"
          ],
          "instructions": "Season both sides of chicken breasts with garlic salt and pepper.\nHeat olive oil in a skillet over medium heat; cook seasoned chicken breasts until chicken is browned, 3 to 4 minutes per side. Add onion; cook and stir until onion is browned, 3 to 4 minutes.\nPour diced tomatoes and balsamic vinegar over chicken; season with basil, oregano, rosemary and thyme. Simmer until chicken is no longer pink and the juices run clear, about 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/532125.jpg"
     },
     {
          "title": "Chicken Enchiladas II",
          "url": "https://www.allrecipes.com/recipe/8694/chicken-enchiladas-ii/",
          "rating": "4.56",
          "numreviews": "3218",
          "ingredients": [
               "1 tablespoon butter",
               "1/2 cup chopped green onions",
               "1/2 teaspoon garlic powder",
               "1 (4 ounce) can diced green chiles",
               "1 (10.75 ounce) can condensed cream of mushroom soup",
               "1/2 cup sour cream",
               "1 1/2 cups cubed cooked chicken breast meat",
               "1 cup shredded Cheddar cheese, divided",
               "6 (12 inch) flour tortillas",
               "1/4 cup milk"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a large baking dish.\nIn a medium saucepan over medium heat, melt the butter and saute the green onion until tender (about 3 to 4 minutes). Add the garlic powder, then stir in the green chiles, cream of mushroom soup and sour cream. Mix well. Reserve 3/4 of this sauce and set aside. To the remaining 1/4 of the sauce in the saucepan, add the chicken and 1/2 cup of shredded Cheddar cheese. Stir together.\nFill each flour tortilla with the chicken mixture and roll up. Place seam side down in the prepared baking dish.\nIn a small bowl combine the reserved 3/4 of the sauce with the milk. Spoon this mixture over the rolled tortillas and top with the remaining 1/2 cup of shredded Cheddar cheese. Bake in the preheated oven for 30 to 35 minutes, or until cheese is bubbly.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/663423.jpg"
     },
     {
          "title": "Soft Oatmeal Cookies",
          "url": "https://www.allrecipes.com/recipe/19247/soft-oatmeal-cookies/",
          "rating": "4.69",
          "numreviews": "3504",
          "ingredients": [
               "1 cup butter, softened",
               "1 cup white sugar",
               "1 cup packed brown sugar",
               "2 eggs",
               "1 teaspoon vanilla extract",
               "2 cups all-purpose flour",
               "1 teaspoon baking soda",
               "1 teaspoon salt",
               "1 1/2 teaspoons ground cinnamon",
               "3 cups quick cooking oats"
          ],
          "instructions": "In a medium bowl, cream together butter, white sugar, and brown sugar. Beat in eggs one at a time, then stir in vanilla. Combine flour, baking soda, salt, and cinnamon; stir into the creamed mixture. Mix in oats. Cover, and chill dough for at least one hour.\nPreheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets. Roll the dough into walnut sized balls, and place 2 inches apart on cookie sheets. Flatten each cookie with a large fork dipped in sugar.\nBake for 8 to 10 minutes in preheated oven. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/3779973.jpg"
     },
     {
          "title": "Rosemary Ranch Chicken Kabobs",
          "url": "https://www.allrecipes.com/recipe/64513/rosemary-ranch-chicken-kabobs/",
          "rating": "4.71",
          "numreviews": "3169",
          "ingredients": [
               "1/2 cup olive oil",
               "1/2 cup ranch dressing",
               "3 tablespoons Worcestershire sauce",
               "1 tablespoon minced fresh rosemary",
               "2 teaspoons salt",
               "1 teaspoon lemon juice",
               "1 teaspoon white vinegar",
               "1/4 teaspoon ground black pepper, or to taste",
               "1 tablespoon white sugar, or to taste (optional)",
               "5 skinless, boneless chicken breast halves - cut into 1 inch cubes"
          ],
          "instructions": "In a medium bowl, stir together the olive oil, ranch dressing, Worcestershire sauce, rosemary, salt, lemon juice, white vinegar, pepper, and sugar.  Let stand for 5 minutes.  Place chicken in the bowl, and stir to coat with the marinade.  Cover and refrigerate for 30 minutes.\nPreheat the grill for medium-high heat.  Thread chicken onto skewers and discard marinade.\nLightly oil the grill grate.  Grill skewers for 8 to 12 minutes, or until the chicken is no longer pink in the center, and the juices run clear.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/642001.jpg"
     },
     {
          "title": "Annie's Fruit Salsa and Cinnamon Chips",
          "url": "https://www.allrecipes.com/recipe/26692/annies-fruit-salsa-and-cinnamon-chips/",
          "rating": "4.78",
          "numreviews": "3275",
          "ingredients": [
               "2 kiwis, peeled and diced",
               "2 Golden Delicious apples - peeled, cored and diced",
               "8 ounces raspberries",
               "1 pound strawberries",
               "2 tablespoons white sugar",
               "1 tablespoon brown sugar",
               "3 tablespoons fruit preserves, any flavor",
               "10 (10 inch) flour tortillas",
               "butter flavored cooking spray",
               "2 tablespoons cinnamon sugar"
          ],
          "instructions": "In a large bowl, thoroughly mix kiwis, Golden Delicious apples, raspberries, strawberries, white sugar, brown sugar and fruit preserves. Cover and chill in the refrigerator at least 15 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nCoat one side of each flour tortilla with butter flavored cooking spray. Cut into wedges and arrange in a single layer on a large baking sheet. Sprinkle wedges with desired amount of cinnamon sugar. Spray again with cooking spray.\nBake in the preheated oven 8 to 10 minutes. Repeat with any remaining tortilla wedges. Allow to cool approximately 15 minutes. Serve with chilled fruit mixture.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4536841.jpg"
     },
     {
          "title": "Roast Sticky Chicken-Rotisserie Style",
          "url": "https://www.allrecipes.com/recipe/45954/roast-sticky-chicken-rotisserie-style/",
          "rating": "4.69",
          "numreviews": "3438",
          "ingredients": [
               "4 teaspoons salt",
               "2 teaspoons paprika",
               "1 teaspoon onion powder",
               "1 teaspoon dried thyme",
               "1 teaspoon white pepper",
               "1/2 teaspoon cayenne pepper",
               "1/2 teaspoon black pepper",
               "1/2 teaspoon garlic powder",
               "2 onions, quartered",
               "2 (4 pound) whole chickens"
          ],
          "instructions": "In a small bowl, mix together salt, paprika, onion powder, thyme, white pepper, black pepper, cayenne pepper, and garlic powder. Remove and discard giblets from chicken. Rinse chicken cavity, and pat dry with paper towel. Rub each chicken inside and out with spice mixture. Place 1 onion into the cavity of each chicken. Place chickens in a resealable bag or double wrap with plastic wrap. Refrigerate overnight, or at least 4 to 6 hours.\nPreheat oven to 250 degrees F (120 degrees C).\nPlace chickens in a roasting pan. Bake uncovered for 5 hours, to a minimum internal temperature of 180 degrees F (85 degrees C). Let the chickens stand for 10 minutes before carving.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/46458.jpg"
     },
     {
          "title": "Salisbury Steak",
          "url": "https://www.allrecipes.com/recipe/14595/salisbury-steak/",
          "rating": "4.41",
          "numreviews": "3321",
          "ingredients": [
               "1 (10.5 ounce) can condensed French onion soup",
               "1 1/2 pounds ground beef",
               "1/2 cup dry bread crumbs",
               "1 egg",
               "1/4 teaspoon salt",
               "1/8 teaspoon ground black pepper",
               "1 tablespoon all-purpose flour",
               "1/4 cup ketchup",
               "1/4 cup water",
               "1 tablespoon Worcestershire sauce",
               "1/2 teaspoon mustard powder"
          ],
          "instructions": "In a large bowl, mix together 1/3 cup condensed French onion soup with ground beef, bread crumbs, egg, salt and black pepper. Shape into 6 oval patties.\nIn a large skillet over medium-high heat, brown both sides of patties. Pour off excess fat.\nIn a small bowl, blend flour and remaining soup until smooth. Mix in ketchup, water, Worcestershire sauce and mustard powder. Pour over meat in skillet. Cover, and cook for 20 minutes, stirring occasionally.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/376047.jpg"
     },
     {
          "title": "Peanut Butter Cup Cookies",
          "url": "https://www.allrecipes.com/recipe/9471/peanut-butter-cup-cookies/",
          "rating": "4.80",
          "numreviews": "3138",
          "ingredients": [
               "1 3/4 cups all-purpose flour",
               "1/2 teaspoon salt",
               "1 teaspoon baking soda",
               "1/2 cup butter, softened",
               "1/2 cup white sugar",
               "1/2 cup peanut butter",
               "1/2 cup packed brown sugar",
               "1 egg, beaten",
               "1 teaspoon vanilla extract",
               "2 tablespoons milk",
               "40 miniature chocolate covered peanut butter cups, unwrapped"
          ],
          "instructions": "Preheat oven to 375 degrees F (190 degrees C). Sift together the flour, salt and baking soda; set aside.\nCream together the butter, sugar, peanut butter and brown sugar until fluffy. Beat in the egg, vanilla and milk. Add the flour mixture; mix well. Shape into 40 balls and place each into an ungreased mini muffin pan.\nBake at 375 degrees for about 8 minutes. Remove from oven and immediately press a mini peanut butter cup into each ball. Cool and carefully remove from pan.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/271187.jpg"
     },
     {
          "title": "Iced Pumpkin Cookies",
          "url": "https://www.allrecipes.com/recipe/10033/iced-pumpkin-cookies/",
          "rating": "4.72",
          "numreviews": "3304",
          "ingredients": [
               "2 1/2 cups all-purpose flour",
               "1 teaspoon baking powder",
               "1 teaspoon baking soda",
               "2 teaspoons ground cinnamon",
               "1/2 teaspoon ground nutmeg",
               "1/2 teaspoon ground cloves",
               "1/2 teaspoon salt",
               "1/2 cup butter, softened",
               "1 1/2 cups white sugar",
               "1 cup canned pumpkin puree",
               "1 egg",
               "1 teaspoon vanilla extract",
               "2 cups confectioners' sugar",
               "3 tablespoons milk",
               "1 tablespoon melted butter",
               "1 teaspoon vanilla extract"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Combine flour, baking powder, baking soda, cinnamon, nutmeg, ground cloves, and salt; set aside.\nIn a medium bowl, cream together the 1/2 cup of  butter and white sugar. Add pumpkin, egg, and 1 teaspoon vanilla to butter mixture, and beat until creamy. Mix in dry ingredients. Drop on cookie sheet by tablespoonfuls; flatten slightly.\nBake for 15 to 20 minutes in the preheated oven. Cool cookies, then drizzle glaze with fork.\nTo Make Glaze: Combine confectioners' sugar, milk, 1 tablespoon melted butter, and 1 teaspoon vanilla. Add milk as needed, to achieve drizzling consistency.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/2718512.jpg"
     },
     {
          "title": "Waffles I",
          "url": "https://www.allrecipes.com/recipe/22180/waffles-i/",
          "rating": "4.50",
          "numreviews": "3275",
          "ingredients": [
               "2 eggs",
               "2 cups all-purpose flour",
               "1 3/4 cups milk",
               "1/2 cup vegetable oil",
               "1 tablespoon white sugar",
               "4 teaspoons baking powder",
               "1/4 teaspoon salt",
               "1/2 teaspoon vanilla extract"
          ],
          "instructions": "Preheat waffle iron. Beat eggs in large bowl with hand beater until fluffy.  Beat in flour, milk, vegetable oil, sugar, baking powder, salt and vanilla,  just until smooth.\nSpray preheated waffle iron with non-stick cooking spray. Pour mix onto hot waffle iron. Cook until golden brown. Serve hot.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/3875444.jpg"
     },
     {
          "title": "Sweet, Sticky and Spicy Chicken",
          "url": "https://www.allrecipes.com/recipe/143082/sweet-sticky-and-spicy-chicken/",
          "rating": "4.49",
          "numreviews": "3148",
          "ingredients": [
               "1 tablespoon brown sugar",
               "2 tablespoons honey",
               "1/4 cup soy sauce",
               "2 teaspoons chopped fresh ginger root",
               "2 teaspoons chopped garlic",
               "2 tablespoons hot sauce",
               "salt and pepper to taste",
               "4 skinless, boneless chicken breast halves - cut into 1/2 inch strips",
               "1 tablespoon vegetable oil"
          ],
          "instructions": "Mix together brown sugar, honey, soy sauce, ginger, garlic and hot sauce in a small bowl.\nLightly salt and pepper the chicken strips.\nHeat oil in a large skillet over medium heat. Add chicken strips and brown on both sides, about 1 minute per side. Pour the sauce over the chicken. Simmer uncovered until the sauce thickens, 8 to 10 minutes.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/1655056.jpg"
     },
     {
          "title": "Jay's Signature Pizza Crust",
          "url": "https://www.allrecipes.com/recipe/7245/jays-signature-pizza-crust/",
          "rating": "4.69",
          "numreviews": "3208",
          "ingredients": [
               "2 1/4 teaspoons active dry yeast",
               "1/2 teaspoon brown sugar",
               "1 1/2 cups warm water (110 degrees F/45 degrees C)",
               "1 teaspoon salt",
               "2 tablespoons olive oil",
               "3 1/3 cups all-purpose flour"
          ],
          "instructions": "In a large bowl, dissolve the yeast and brown sugar in the water, and let sit for 10 minutes.\nStir the salt and oil into the yeast solution. Mix in 2 1/2 cups of the flour.\nTurn dough out onto a clean, well floured surface, and knead in more flour until the dough is no longer sticky. Place the dough into a well oiled bowl, and cover with a cloth. Let the dough rise until double; this should take about 1 hour. Punch down the dough, and form a tight ball. Allow the dough to relax for a minute before rolling out. Use for your favorite pizza recipe.\nPreheat oven to 425 degrees F (220 degrees C). If you are baking the dough on a pizza stone, you may place your toppings on the dough, and bake immediately. If you are baking your pizza in a pan, lightly oil the pan, and let the dough rise for 15 or 20 minutes before topping and baking it.\nBake pizza in preheated oven, until the cheese and crust are golden brown, about 15 to 20 minutes.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/45083.jpg"
     },
     {
          "title": "Fluffy French Toast",
          "url": "https://www.allrecipes.com/recipe/16895/fluffy-french-toast/",
          "rating": "4.63",
          "numreviews": "2805",
          "ingredients": [
               "1/4 cup all-purpose flour",
               "1 cup milk",
               "1 pinch salt",
               "3 eggs",
               "1/2 teaspoon ground cinnamon",
               "1 teaspoon vanilla extract",
               "1 tablespoon white sugar",
               "12 thick slices bread"
          ],
          "instructions": "Measure flour into a large mixing bowl. Slowly whisk in the milk. Whisk in the salt, eggs, cinnamon, vanilla extract and sugar until smooth.\nHeat a lightly oiled griddle or frying pan over medium heat.\nSoak bread slices in mixture until saturated. Cook bread on each side until golden brown. Serve hot.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/2049275.jpg"
     },
     {
          "title": "Jamie's Cranberry Spinach Salad",
          "url": "https://www.allrecipes.com/recipe/14469/jamies-cranberry-spinach-salad/",
          "rating": "4.79",
          "numreviews": "2895",
          "ingredients": [
               "1 tablespoon butter",
               "3/4 cup almonds, blanched and slivered",
               "1 pound spinach, rinsed and torn into bite-size pieces",
               "1 cup dried cranberries",
               "2 tablespoons toasted sesame seeds",
               "1 tablespoon poppy seeds",
               "1/2 cup white sugar",
               "2 teaspoons minced onion",
               "1/4 teaspoon paprika",
               "1/4 cup white wine vinegar",
               "1/4 cup cider vinegar",
               "1/2 cup vegetable oil"
          ],
          "instructions": "In a medium saucepan, melt butter over medium heat. Cook and stir almonds in butter until lightly toasted. Remove from heat, and let cool.\nIn a medium bowl, whisk together the sesame seeds, poppy seeds, sugar, onion, paprika, white wine vinegar, cider vinegar, and vegetable oil. Toss with spinach just before serving.\nIn a large bowl, combine the spinach with the toasted almonds and cranberries.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/273205.jpg"
     },
     {
          "title": "J.P.'s Big Daddy Biscuits",
          "url": "https://www.allrecipes.com/recipe/7040/jps-big-daddy-biscuits/",
          "rating": "4.64",
          "numreviews": "3389",
          "ingredients": [
               "2 cups all-purpose flour",
               "1 tablespoon baking powder",
               "1 teaspoon salt",
               "1 tablespoon white sugar",
               "1/3 cup shortening",
               "1 cup milk"
          ],
          "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nIn a large bowl, whisk together the flour, baking powder, salt, and sugar. Cut in the shortening until the mixture resembles coarse meal. Gradually stir in milk until dough pulls away from the side of the bowl.\nTurn out onto a floured surface, and knead 15 to 20 times. Pat or roll dough out to 1 inch thick. Cut biscuits with a large cutter or juice glass dipped in flour. Repeat until all dough is used. Brush off the excess flour, and place biscuits onto an ungreased baking sheet.\nBake for 13 to 15 minutes in the preheated oven, or until edges begin to brown.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4512167.jpg"
     },
     {
          "title": "Slow Cooker Beef Stroganoff I",
          "url": "https://www.allrecipes.com/recipe/16352/slow-cooker-beef-stroganoff-i/",
          "rating": "4.38",
          "numreviews": "2904",
          "ingredients": [
               "1 pound cubed beef stew meat",
               "1 (10.75 ounce) can condensed golden mushroom soup",
               "1/2 cup chopped onion",
               "1 tablespoon Worcestershire sauce",
               "1/4 cup water",
               "4 ounces cream cheese"
          ],
          "instructions": "In a slow cooker, combine the meat, soup, onion, Worcestershire sauce and water.\nCook on Low setting for 8 hours, or on High setting for about 5 hours. Stir in cream cheese just before serving.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/1328848.jpg"
     },
     {
          "title": "Slow Cooker Chicken Stroganoff",
          "url": "https://www.allrecipes.com/recipe/17227/slow-cooker-chicken-stroganoff/",
          "rating": "4.39",
          "numreviews": "3118",
          "ingredients": [
               "4 skinless, boneless chicken breast halves - cubed",
               "1/8 cup margarine",
               "1 (.7 ounce) package dry Italian-style salad dressing mix",
               "1 (8 ounce) package cream cheese",
               "1 (10.75 ounce) can condensed cream of chicken soup"
          ],
          "instructions": "Put chicken, margarine and dressing mix in slow cooker; mix together and cook on low for 5 to 6 hours.\nAdd cream cheese and soup, mix together and cook on high for another 1/2 hour or until heated through and warm.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/508287.jpg"
     },
     {
          "title": "Easy Slow Cooker French Dip",
          "url": "https://www.allrecipes.com/recipe/16239/easy-slow-cooker-french-dip/",
          "rating": "4.51",
          "numreviews": "2858",
          "ingredients": [
               "4 pounds rump roast",
               "1 (10.5 ounce) can beef broth",
               "1 (10.5 ounce) can condensed French onion soup",
               "1 (12 fluid ounce) can or bottle beer",
               "6 French rolls",
               "2 tablespoons butter"
          ],
          "instructions": "Trim excess fat from the rump roast, and place in a slow cooker. Add the beef broth, onion soup and beer. Cook on Low setting for 7 hours.\nPreheat oven to 350 degrees F (175 degrees C).\nSplit French rolls, and spread with butter. Bake 10 minutes, or until heated through.\nSlice the meat on the diagonal, and place on the rolls. Serve the sauce for dipping.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/10316.jpg"
     },
     {
          "title": "Meatball Nirvana",
          "url": "https://www.allrecipes.com/recipe/213742/meatball-nirvana/",
          "rating": "4.63",
          "numreviews": "2826",
          "ingredients": [
               "1 pound extra lean ground beef",
               "1/2 teaspoon sea salt",
               "1 small onion, diced",
               "1/2 teaspoon garlic salt",
               "1 1/2 teaspoons Italian seasoning",
               "3/4 teaspoon dried oregano",
               "3/4 teaspoon crushed red pepper flakes",
               "1 dash hot pepper sauce (such as Frank's RedHot(R)), or to taste",
               "1 1/2 tablespoons Worcestershire sauce",
               "1/3 cup skim milk",
               "1/4 cup grated Parmesan cheese",
               "1/2 cup seasoned bread crumbs"
          ],
          "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nPlace the beef into a mixing bowl, and season with salt, onion, garlic salt, Italian seasoning, oregano, red pepper flakes, hot pepper sauce, and Worcestershire sauce; mix well. Add the milk, Parmesan cheese, and bread crumbs. Mix until evenly blended, then form into 1 1/2-inch meatballs, and place onto a baking sheet.\nBake in the preheated oven until no longer pink in the center, 20 to 25 minutes.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/397070.jpg"
     },
     {
          "title": "Banana Muffins II",
          "url": "https://www.allrecipes.com/recipe/42719/banana-muffins-ii/",
          "rating": "4.78",
          "numreviews": "3284",
          "ingredients": [
               "1 1/2 cups all-purpose flour",
               "1 teaspoon baking powder",
               "1 teaspoon baking soda",
               "1/2 teaspoon salt",
               "3 large bananas, mashed",
               "3/4 cup white sugar",
               "1 egg",
               "1/3 cup butter, melted"
          ],
          "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat muffin pans with non-stick spray, or use paper liners. Sift together the flour, baking powder, baking soda, and salt; set aside.\nCombine bananas, sugar, egg, and melted butter in a large bowl. Fold in flour mixture, and mix until smooth. Scoop into muffin pans.\nBake in preheated oven. Bake mini muffins for 10 to 15 minutes, and large muffins for 25 to 30 minutes. Muffins will spring back when lightly tapped.",
          "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/187952.jpg"
     }
]