{"title": "Summer Special Shrimp and Fruit Fried Rice", "url": "https://www.allrecipes.com/recipe/166862/summer-special-shrimp-and-fruit-fried-rice/", "rating": "4.50", "numreviews": "10", "ingredients": ["1 tablespoon vegetable oil, divided", "2 eggs, beaten", "1/2 pound peeled and deveined medium shrimp", "1 (1 inch) piece fresh ginger root, minced", "2 red onions, sliced", "3 green chile peppers, chopped", "2/3 cup fresh pineapple, diced", "1/2 cup orange segments", "6 walnuts, chopped", "2 cups cold, cooked white rice", "1 tablespoon soy sauce", "2 tablespoons chopped fresh cilantro", "salt and pepper to taste"], "instructions": "Heat 1 teaspoon of the vegetable oil in a wok over medium-high heat. Pour in the onions, and cook until just set; set aside. Increase the heat to high, and pour another 1 teaspoon of oil to the wok. Stir in the shrimp, and cook until the shrimp turn pink, and are no longer translucent in the center, about 3 minutes; set aside.\nWipe out the wok, and heat the remaining teaspoon of oil over high heat. Stir in the ginger, and cook quickly for a few seconds until the ginger begins to turn golden brown. Stir in the onion and chile peppers; cook for a minute or two until the onions begin to soften and turn brown around the edges. Add the pineapple and oranges, and gently cook until the pineapple is hot.\nStir in the rice, walnuts, and soy sauce. Stir for a few minutes until the rice is hot. Fold in the egg, shrimp, and cilantro. Season to taste with salt and pepper, and cook to reheat.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/1078508.jpg"}
{"title": "Strawberry-Rhubarb Compote", "url": "https://www.allrecipes.com/recipe/274342/strawberry-rhubarb-compote/", "rating": "0.00", "numreviews": "0", "ingredients": ["2 cups chopped fresh strawberries", "2 cups chopped rhubarb", "1/3 cup brown sugar", "1/8 teaspoon salt"], "instructions": "Combine chopped strawberries and rhubarb in a saucepan. Add sugar and salt; stir to coat evenly. Let sit until fruit has released its juices, about 10 minutes.\nBring fruit mixture to a light boil over medium heat. Reduce heat to medium-low and simmer, stirring occasionally, until fruit is soft and mixture has thickened, about 20 minutes. Remove from heat and let cool, about 30 minutes. Mixture will further thicken upon cooling. Place in a jar or storage container and refrigerate for up to a week.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6750673.jpg"}
{"title": "Sour Cream Blueberry Muffins ", "url": "https://www.allrecipes.com/recipe/274332/sour-cream-blueberry-muffins/", "rating": "0.00", "numreviews": "0", "ingredients": ["cooking spray", "Crumb Topping:", "1/2 cup all-purpose flour", "1/4 cup brown sugar", "1/2 teaspoon ground cinnamon", "1/4 teaspoon salt", "1/4 cup butter, softened", "Muffins:", "2 cups all-purpose flour", "3 teaspoons baking powder", "1 teaspoon cinnamon", "1/4 teaspoon salt", "2 large eggs", "1/2 cup granulated sugar", "1/2 cup brown sugar", "1 cup sour cream", "1/2 cup vegetable oil", "1 teaspoon vanilla extract", "2 cups blueberries", "1 tablespoon all-purpose flour"], "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Spray 16 muffin cups with cooking spray or line cups with paper liners.\nCombine 1/2 cup flour, 1/4 cup brown sugar, 1/2 teaspoon cinnamon, and 1/4 teaspoon salt in a small bowl. Cut butter into the flour mixture until it is crumbly. Set crumb topping aside.\nWhisk 2 cups flour, baking powder, 1 teaspoon cinnamon, and 1/4 teaspoon salt together in a large bowl, making a well in the center. Whisk eggs, granulated sugar, and 1/2 cup brown sugar together in a separate bowl. Stir in sour cream, vegetable oil, and vanilla extract until well combined. Pour into the well in the flour mixture and stir until batter is just combined without overmixing. Toss blueberries with 1 tablespoon flour in a small bowl and gently fold into the batter.\nSpoon batter into the prepared muffin cups, filling each 3/4 full. Top each muffin with about 1 tablespoon of crumb mixture.\nBake in the preheated oven until tops spring back when lightly pressed and muffins are lightly browned, 18 to 22 minutes. A toothpick inserted into the center of the muffins should come out clean. Cool in the tins for 10 minutes. Transfer to a wire rack to cool completely.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6752952.jpg"}
{"title": "Armenian Stuffed Eggplant (Imam Bayildi)", "url": "https://www.allrecipes.com/recipe/274390/armenian-stuffed-eggplant-imam-bayildi/", "rating": "0.00", "numreviews": "0", "ingredients": ["2 large eggplants", "1/4 cup olive oil, divided", "1 red bell pepper, cut into 1-inch strips", "1/2 onion, sliced", "3 cloves garlic, minced", "2 tomatoes, chopped", "1 (8 ounce) can tomato sauce with no salt added", "1/8 teaspoon salt", "1/8 teaspoon ground black pepper", "1 pinch chopped fresh parsley, or to taste"], "instructions": "Preheat the oven to 450 degrees F (230 degrees C).\nCut eggplants in 1/2, then cut each 1/2 into thirds, leaving 12 eggplant spears total. Place on a baking sheet and brush with 2 tablespoons olive oil.\nRoast in the preheated oven until fork tender, 15 to 20 minutes. Reduce the oven temperature to 350 degrees F (175 degrees C).\nWhile eggplants are cooking, heat remaining 2 tablespoons olive oil over medium heat in a medium to large pan. Add bell pepper, onion, and garlic to the hot pan and cook until onions become tender, 5 to 7 minutes. Stir in tomatoes and cook until most of the liquid has evaporated, 2 to 3 minutes. Set aside to cool.\nRemove eggplants from the oven and let cool slightly, 5 to 10 minutes. Transfer eggplants to a 9x13-inch baking dish. Slice each spear vertically using a fork and knife, being careful not to cut through skin. Pry each open and fill with 2 to 3 tablespoons of tomato filling. Cover with tomato sauce.\nBake in the preheated oven until bubbling, about 30 minutes. Season with salt and pepper. Garnish with parsley.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6779557.jpg"}
{"title": "Savory Western Crepes", "url": "https://www.allrecipes.com/recipe/274293/savory-western-crepes/", "rating": "0.00", "numreviews": "0", "ingredients": ["Crepe Batter:", "1 1/2 cups milk", "1 cup all-purpose flour", "2 large eggs", "2 tablespoons chopped fresh cilantro", "1 tablespoon melted butter", "2 teaspoons chile-garlic sauce (such as Sriracha(R))", "Crepe Filling:", "8 large eggs", "1/4 cup milk", "1/2 cup shredded Cheddar cheese", "salt and freshly ground black pepper to taste", "1 teaspoon olive oil", "1/3 cup diced onion", "1/3 cup diced red bell pepper", "3 tablespoons diced jalapeno pepper (optional)", "1/2 cup chopped ham", "2 tablespoons melted butter, or as needed, divided"], "instructions": "Combine milk, flour, eggs, cilantro, melted butter, and chile-garlic sauce in a blender. Blend until smooth and very thin, about 1 minute. Set batter aside to rest for at least 30 minutes.\nHeat a crepe pan or small skillet over medium heat. Brush 1 tablespoon melted butter into the pan using a pastry brush and add 1/2 cup of crepe batter. Pick up the pan, tipping and rotating so batter forms a round shape and evenly coats the entire bottom of the pan. Return the pan to the burner and cook until small brown spots appear on the bottom of the crepe, 1 to 2 minutes.\nLoosen crepe carefully using a spatula and gently flip it to brown the other side; cook for 30 to 60 seconds. Slide cooked crepe onto a plate. Repeat to cook additional crepes, adding more butter if needed, and stacking crepes on top of the first.\nWhisk eggs and milk in a large bowl until well blended. Stir in Cheddar cheese, salt, and pepper.\nHeat oil in a skillet over medium heat. Add onion, bell pepper, and jalapeno pepper and cook until tender, about 3 minutes. Stir in ham and continue cooking for another 2 minutes. Reduce heat to low and stir 1 tablespoon melted butter into the skillet. Add egg mixture and cook, stirring until eggs are scrambled and wet, but no longer runny, 3 to 5 minutes. Remove from heat.\nSpoon about 1/4 cup of the egg mixture across the lower 1/3 of a crepe and roll up like a jelly roll. Repeat with remaining crepes and filling.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6732798.jpg"}
{"title": "Lemon-Blueberry Scones with Blueberry Glaze", "url": "https://www.allrecipes.com/recipe/274317/lemon-blueberry-scones-with-blueberry-glaze/", "rating": "0.00", "numreviews": "0", "ingredients": ["1 1/4 cups whole wheat flour", "1 cup all-purpose flour", "1/4 cup white sugar", "2 1/2 teaspoons baking powder", "1 teaspoon ground cardamom", "1 teaspoon lemon zest", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1/4 teaspoon ground ginger", "1/2 cup unsalted butter, frozen", "1/2 cup whole-milk Greek yogurt", "3 tablespoons heavy cream", "1 egg", "2 teaspoons vanilla extract", "1 cup frozen blueberries, unthawed", "Egg Wash:", "1 egg", "1 teaspoon water", "Glaze:", "1/4 cup frozen blueberries, thawed", "2/3 cup confectioners' sugar", "1 tablespoon lemon juice"], "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Line a large baking sheet with parchment paper.\nCombine whole wheat flour, all-purpose flour, sugar, baking powder, cardamom, lemon zest, baking soda, salt, and ginger in a large bowl. Grate in frozen butter using a box grater and toss until mixture resembles coarse crumbs.\nMix yogurt, cream, egg, and vanilla extract together in a small bowl. Add to the flour mixture to form a crumbly dough, stirring just until no dry clumps of flour remain. Stir in unthawed blueberries.\nPour crumbly dough onto the parchment-lined baking sheet. Press dough together firmly until it forms a cohesive 8-inch circle. Flatten top to ensure the circle is even. Cut into 8 triangular pieces. Arrange the pieces 1 inch apart on the same parchment-lined pan.\nWhisk egg and water together in a small bowl for the egg wash. Gently brush over the top of each scone.\nBake scones in the preheated oven until tops are golden brown, 20 to 25 minutes. Let cool completely, about 30 minutes.\nUse the back of a wooden spoon to press thawed blueberries through a fine-mesh strainer into a medium bowl to extract 2 or 3 tablespoons of juice. Discards skins and seeds. Whisk confectioners' sugar and lemon juice into the blueberry juice until smooth. Drizzle blueberry glaze over cooled scones.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6765602.jpg"}
{"title": "Garlic Shrimp Kabobs", "url": "https://www.allrecipes.com/recipe/273793/garlic-shrimp-kabobs/", "rating": "5.00", "numreviews": "1", "ingredients": ["1 pound frozen shrimp, thawed and peeled", "1/4 cup olive oil", "1 tablespoon minced garlic", "2 teaspoons lemon juice", "1/4 teaspoon pepper", "1 pinch finely chopped parsley", "metal skewers", "cooking spray"], "instructions": "Rinse and dry shrimp.\nWhisk olive oil, garlic, lemon juice, pepper, and parsley together in a bowl and pour into a large resealable plastic bag. Add shrimp, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 2 hours.\nPreheat an outdoor grill for medium heat and lightly oil the grate. Lightly coat metal skewers with cooking spray.\nRemove shrimp from the marinade and shake off excess. Discard the remaining marinade. Place about 5 shrimp on each skewer.\nCook on the preheated grill until shrimp are bright pink on the outside and the meat is opaque, about 5 minutes; do not overcook.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6795468.jpg"}
{"title": "Strawberry Lemonade Cake", "url": "https://www.allrecipes.com/recipe/274413/strawberry-lemonade-cake/", "rating": "0.00", "numreviews": "0", "ingredients": ["Strawberry Reduction:", "5 cups fresh strawberries, hulled and sliced", "1/4 cup white sugar", "1 tablespoon lemon juice", "Cake:", "3 cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon baking powder", "1/2 teaspoon salt", "2 cups white sugar", "1 cup unsalted butter, softened", "4 eggs, room temperature", "1 1/2 tablespoons lemon zest", "1 teaspoon vanilla extract", "3/4 cup sour cream, room temperature", "1/4 cup lemon juice", "Frosting:", "1 1/2 cups unsalted butter, softened", "5 cups powdered sugar, or more as needed", "1 tablespoon lemon juice", "1 teaspoon vanilla extract", "1 teaspoon lemon zest", "1/4 teaspoon salt", "4 tablespoons heavy cream"], "instructions": "Place strawberries, sugar, and lemon juice for the reduction into an electric blender and puree until smooth.\nPour strawberry mixture into a large saucepan and simmer over medium heat, stirring frequently, until reduced by 1/2, 20 to 25 minutes. Remove from heat and let cool to room temperature, 10 to 15 minutes. Reserve 1/2 cup plus 5 tablespoons for cake and frosting; remainder will be used as cake filling.\nPreheat the oven to 350 degrees F (175 degrees C). Grease two 9-inch cake pans and line with parchment paper.\nWhisk flour, baking soda, baking powder, and salt together in a medium bowl. Set aside.\nBeat sugar and butter using an electric mixer in a large bowl until creamy. Beat in eggs one at a time, mixing thoroughly after each addition. Mix in lemon zest and vanilla extract. Stir in 1/3 of the flour mixture until just combined. Stir in 1/2 of the sour cream, and 1/2 of the lemon juice. Repeat alternating additions of flour mixture and sour cream plus lemon juice until just combined, making sure not to overmix.\nPlace 1/2 of the batter into a separate bowl. Fold in 1/2 cup strawberry reduction. Place dollops of both lemon and strawberry-lemon batters alternately into the prepared cake pans. Swirl batters together with a butter knife.\nBake in the preheated oven until a toothpick inserted into the center of each cake comes out clean, 30 to 35 minutes. Remove from the oven and let cool for 10 minutes in the pans before removing and transferring cakes to a wire rack to cool completely, 15 to 30 minutes.\nWhile cakes are cooling, beat butter for frosting with an electric mixer in a mixing bowl until light and fluffy. Beat in powdered sugar 1 cup at a time until incorporated. Mix in 5 tablespoons strawberry reduction, lemon juice, vanilla extract, lemon zest, and salt until combined. Pour in heavy cream and beat until frosting is smooth and fluffy, 2 to 3 minutes. Add additional powdered sugar if too thin, or additional heavy cream if too thick, 1 tablespoon at a time, until desired consistency is reached.\nPlace 1 cooled cake layer on a serving platter and cover top with a thin layer of frosting. Pipe a border around the edge of the cake layer using a piping bag filled with frosting, leaving the center open. Pour remaining strawberry reduction into the center of the border, making sure it doesn't overflow over the sides. Place second cake layer on top and continue to frost as desired. Keep refrigerated until ready to serve.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/6799549.jpg"}
{"title": "Bucatini Cacio e Pepe (Roman Sheep Herder's Pasta)", "url": "https://www.allrecipes.com/recipe/274411/bucatini-cacio-e-pepe-roman-sheep-herders-pasta/", "rating": "0.00", "numreviews": "0", "ingredients": ["1 teaspoon salt", "1 pound bucatini (dry)", "2 cups finely grated Pecorino Romano cheese", "1 1/2 tablespoons freshly ground black pepper, or more to taste"], "instructions": "Bring a large pot of water to a boil and add salt. Cook bucatini in the boiling water, stirring occasionally, until tender yet firm to the bite, 8 to 10 minutes.\nPlace grated Pecorino Romano cheese into a large glass bowl and mix with a fork to make sure the cheese contains no lumps.\nOnce the bucatini are al dente, lift them out with a spaghetti fork or tongs and put them directly into the bowl with the cheese. Do not allow the water to drain too much.\nAdd one ladle of pasta water to the bowl. Stir the bucatini around until a cream has formed. Add more pasta water, little by little, until a thick cream has formed. Sprinkle freshly ground pepper over the pasta. Toss and serve immediately.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/2253389.jpg"}
{"title": "World's Best Lasagna", "url": "https://www.allrecipes.com/recipe/23600/worlds-best-lasagna/", "rating": "4.79", "numreviews": "12260", "ingredients": ["1 pound sweet Italian sausage", "3/4 pound lean ground beef", "1/2 cup minced onion", "2 cloves garlic, crushed", "1 (28 ounce) can crushed tomatoes", "2 (6 ounce) cans tomato paste", "2 (6.5 ounce) cans canned tomato sauce", "1/2 cup water", "2 tablespoons white sugar", "1 1/2 teaspoons dried basil leaves", "1/2 teaspoon fennel seeds", "1 teaspoon Italian seasoning", "1 tablespoon salt", "1/4 teaspoon ground black pepper", "4 tablespoons chopped fresh parsley", "12 lasagna noodles", "16 ounces ricotta cheese", "1 egg", "1/2 teaspoon salt", "3/4 pound mozzarella cheese, sliced", "3/4 cup grated Parmesan cheese"], "instructions": "In a Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until well browned. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with sugar, basil, fennel seeds, Italian seasoning, 1 tablespoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally.\nBring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water.  In a mixing bowl, combine ricotta cheese with egg, remaining parsley, and 1/2 teaspoon salt.\nPreheat oven to 375  degrees F (190 degrees C).\nTo assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13 inch baking dish.  Arrange 6 noodles lengthwise over meat sauce. Spread with one half of the ricotta cheese mixture. Top with a third of mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese.  Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese.\nBake in preheated oven for 25 minutes. Remove foil, and bake an additional 25 minutes. Cool for 15 minutes before serving.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/3359675.jpg"}
{"title": "Fluffy Pancakes", "url": "https://www.allrecipes.com/recipe/162760/fluffy-pancakes/", "rating": "4.82", "numreviews": "10917", "ingredients": ["3/4 cup milk", "2 tablespoons white vinegar", "1 cup all-purpose flour", "2 tablespoons white sugar", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1 egg", "2 tablespoons butter, melted", "cooking spray"], "instructions": "Combine milk with vinegar in a medium bowl and set aside for 5 minutes to \"sour\".\nCombine flour, sugar, baking powder, baking soda, and salt in a large mixing bowl. Whisk egg and butter into \"soured\" milk. Pour the flour mixture into the wet ingredients and whisk until lumps are gone.\nHeat a large skillet over medium heat, and coat with cooking spray. Pour 1/4 cupfuls of batter onto the skillet, and cook until bubbles appear on the surface. Flip with a spatula, and cook until browned on the other side.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/5079227.jpg"}
{"title": "Best Chocolate Chip Cookies", "url": "https://www.allrecipes.com/recipe/10813/best-chocolate-chip-cookies/", "rating": "4.61", "numreviews": "11012", "ingredients": ["1 cup butter, softened", "1 cup white sugar", "1 cup packed brown sugar", "2 eggs", "2 teaspoons vanilla extract", "1 teaspoon baking soda", "2 teaspoons hot water", "1/2 teaspoon salt", "3 cups all-purpose flour", "2 cups semisweet chocolate chips", "1 cup chopped walnuts"], "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCream together the butter, white sugar, and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Dissolve baking soda in hot water.  Add to batter along with salt. Stir in flour, chocolate chips, and nuts. Drop by large spoonfuls onto ungreased pans.\nBake for about 10 minutes in the preheated oven, or until edges are nicely browned.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4462051.jpg"}
{"title": "Good Old Fashioned Pancakes", "url": "https://www.allrecipes.com/recipe/21014/good-old-fashioned-pancakes/", "rating": "4.59", "numreviews": "11217", "ingredients": ["1 1/2 cups all-purpose flour", "3 1/2 teaspoons baking powder", "1 teaspoon salt", "1 tablespoon white sugar", "1 1/4 cups milk", "1 egg", "3 tablespoons butter, melted"], "instructions": "In a large bowl, sift together the flour, baking powder, salt and sugar. Make a well in the center and pour in the milk, egg and melted butter; mix until smooth.\nHeat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4948036.jpg"}
{"title": "Banana Banana Bread", "url": "https://www.allrecipes.com/recipe/20144/banana-banana-bread/", "rating": "4.58", "numreviews": "10716", "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking soda", "1/4 teaspoon salt", "1/2 cup butter", "3/4 cup brown sugar", "2 eggs, beaten", "2 1/3 cups mashed overripe bananas"], "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.\nIn a large bowl, combine flour, baking soda and salt. In a separate bowl, cream together butter and brown sugar. Stir in eggs and mashed bananas until well blended. Stir banana mixture into flour mixture; stir just to moisten. Pour batter into prepared loaf pan.\nBake in preheated oven for 60 to 65 minutes, until a toothpick inserted into center of the loaf comes out clean. Let bread cool in pan for 10 minutes, then turn out onto a wire rack.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/4565477.jpg"}
{"title": "Delicious Ham and Potato Soup", "url": "https://www.allrecipes.com/recipe/56927/delicious-ham-and-potato-soup/", "rating": "4.84", "numreviews": "10201", "ingredients": ["3 1/2 cups peeled and diced potatoes", "1/3 cup diced celery", "1/3 cup finely chopped onion", "3/4 cup diced cooked ham", "3 1/4 cups water", "2 tablespoons chicken bouillon granules", "1/2 teaspoon salt, or to taste", "1 teaspoon ground white or black pepper, or to taste", "5 tablespoons butter", "5 tablespoons all-purpose flour", "2 cups milk"], "instructions": "Combine the potatoes, celery, onion, ham and water in a stockpot. Bring to a boil, then cook over medium heat until potatoes are tender, about 10 to 15 minutes. Stir in the chicken bouillon, salt and pepper.\nIn a separate saucepan, melt butter over medium-low heat. Whisk in flour with a fork, and cook, stirring constantly until thick, about 1 minute. Slowly stir in milk as not to allow lumps to form until all of the milk has been added. Continue stirring over medium-low heat until thick, 4 to 5 minutes.\nStir the milk mixture into the stockpot, and cook soup until heated through. Serve immediately.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/962656.jpg"}
{"title": "Banana Crumb Muffins", "url": "https://www.allrecipes.com/recipe/17652/banana-crumb-muffins/", "rating": "4.81", "numreviews": "10081", "ingredients": ["1 1/2 cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon baking powder", "1/2 teaspoon salt", "3 bananas, mashed", "3/4 cup white sugar", "1 egg, lightly beaten", "1/3 cup butter, melted", "1/3 cup packed brown sugar", "2 tablespoons all-purpose flour", "1/8 teaspoon ground cinnamon", "1 tablespoon butter"], "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease 10 muffin cups, or line with muffin papers.\nIn a large bowl, mix together 1 1/2 cups flour, baking soda, baking powder and salt. In another bowl, beat together bananas, sugar, egg and melted butter. Stir the banana mixture into the flour mixture just until moistened. Spoon batter into prepared muffin cups.\nIn a small bowl, mix together brown sugar, 2 tablespoons flour and cinnamon. Cut in 1 tablespoon butter until mixture resembles coarse cornmeal. Sprinkle topping over muffins.\nBake in preheated oven for 18 to 20 minutes, until a toothpick inserted into center of a muffin comes out clean.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/428420.jpg"}
{"title": "Apple Pie by Grandma Ople", "url": "https://www.allrecipes.com/recipe/12682/apple-pie-by-grandma-ople/", "rating": "4.78", "numreviews": "10432", "ingredients": ["1 recipe pastry for a 9 inch double crust pie", "1/2 cup unsalted butter", "3 tablespoons all-purpose flour", "1/4 cup water", "1/2 cup white sugar", "1/2 cup packed brown sugar", "8 Granny Smith apples - peeled, cored and sliced"], "instructions": "Preheat oven to 425 degrees F (220 degrees C). Melt the butter in a saucepan. Stir in flour to form a paste. Add water, white sugar and brown sugar, and bring to a boil. Reduce temperature and let simmer.\nPlace the bottom crust in your pan. Fill with apples, mounded slightly. Cover with a lattice work crust.  Gently pour the sugar and butter liquid over the crust.  Pour slowly so that it does not run off.\nBake 15 minutes in the preheated oven. Reduce the temperature to 350 degrees F (175 degrees C). Continue baking for 35 to 45 minutes, until apples are soft.", "imgsrc": "https://images.media-allrecipes.com/userphotos/300x300/736203.jpg"}
